{
    "economy": [
        {
            "title": "‘Consumer’ recession forecast for 2023 following Australia’s ‘weakest’ rate of economic growth",
            "link": "https://7news.com.au/business/economy/consumer-recession-forecast-for-2023-following-australias-weakest-rate-of-economic-growth-c-10411447",
            "keywords": null,
            "creator": [
              "Bianca Bongato"
            ],
            "video_url": null,
            "description": "Australians are being warned of a financial ‘knife-edge’. Here’s what it means for you.",
            "content": "Australians are being warned the country’s is on a “knife-edge“ after the Reserve Bank of Australia’s string of interest rate hikes, with a “consumer recession” predicted for 2023. The bleak news comes as Australia faces the “weakest” rate of economic growth outside the COVID pandemic since the recession in the early 1990s, according to a Deloitte Access Economics Business Outlook published this week. In its March 2023 report, it said the RBA is “tempting fate” after the bank announced two interest rate hikes earlier this year, totalling 10 consecutive hikes since May 2022. Looking for a new job or job candidate? Post jobs and search for local talent on The central bank did hit pause on hikes in the April decision - but is expected to press ahead with further hikes going forward. Deloitte Access Economics Partner and report lead author Stephen Smith said the economic circumstances have prompted a downgrade in Australia’s growth. “Our view remains unchanged – the additional 50 basis points of increases earlier this year were unnecessary, and have prompted a further downgrade in Australia’s growth outlook,” Smith said. “That downgrade is centred on our households, and a ‘consumer recession’ is now forecast in 2023, with household spending expected to finish the year below where it started.” While most Australians will pull through the difficult economic challenges, Smith says that many will not, especially mortgage holders. “At a cash rate of 3.6 per cent, most Australians will be just fine. Many, however, will not,” he added. “In just 10 months, the cost of servicing an average $600,000 mortgage will have risen by more than $14,000 per year once those rate hikes are fully passed through. “But that’s just the average, and there are plenty of mortgage holders on either side of those numbers.” That equates to a touch over $1166 per month. In the RBA’s latest Financial Stability Review, the bank suggested about 15 per cent of variable-rate, owner-occupier mortgage holders could be in a “negative cash flow” by the end of 2023, with many borrowers are already projected to be in this position. “On these numbers, at least 300,000 Australian households may currently be experiencing negative cash flow, with mortgage repayments and essential living expenses together exceeding household disposable income,” Smith said. “That should shock all of us.” A rental crisis is also plaguing the country, with a “solid” acceleration in rental growth experienced across Australian states, particularly in Sydney and Melbourne, according to a Domain March 2023 Rental Report. House rents have surged by $135 a week (or 31.4 per cent), while unit rents have increased by $140 (or 34.1 per cent) since the pandemic low, Domain said. “This is an issue of supply and demand, but private dwelling investment is forecast to fall rather than increase through 2023, before recovering only modestly in 2024,” Smith added. “Construction is expected to commence on significantly fewer houses and apartments compared to previous years – in fact, Deloitte Access Economics expects that 2023 will see construction commence on the fewest dwellings in more than a decade and almost 70,000 below the level commencements recorded in 2021.” For Smith, this means that housing supply would “just barely” be able to keep up with the demand in Australia. “On these numbers, new housing supply would just barely keep pace with population growth, let alone ease what is a critical undersupply,” he said. “In short, we are building far too few dwellings and, with a myriad of supply side challenges unresolved, that is unlikely to change in the near term.” Combined issues of a cost of living crisis, a slowdown in dwelling construction, and an unpredictable economic global environment, Deloitte Access Economics revised down expectations for Australian economic growth in 2023 and 2024 to 1.5 per cent and 1.2 per cent respectively. While some industries may survive in this new environment, others will struggle, according to Smith. “Some sectors of the economy are better positioned to face the slowdown than others, with retail and construction forecast to feel the pinch, while agriculture may pull back after recent highs,” he said. But the results vary across Australian states, with the “consumer-led slowdown” set to impact NSW and Victoria the most. “While the consumer-led slowdown will hit hardest in New South Wales and Victoria, conditions are softening in most other jurisdictions as well,” Smith said. “Western Australia and Queensland are still relative bright spots, with mineral exports adding to the growth outlook.”",
            "pubDate": "2023-04-21 23:25:41",
            "image_url": "https://images.7news.com.au/publication/C-10411447/8ff37912464516e10266756f04c94c207f28cb3a-16x9-x0y110w2121h1193.jpg",
            "source_id": "7news",
            "category": [
              "business"
            ],
            "country": [
              "australia"
            ],
            "language": "english"
          },
          {
            "title": "Activists mark Earth Day as scientists warn of more extreme weather",
            "link": "https://www.fijitimes.com/activists-mark-earth-day-as-scientists-warn-of-more-extreme-weather/",
            "keywords": [
              "News",
              "World",
              "Activists mark Earth Day as scientists warn of more extreme weather",
              "Fiji Times World News",
              "Fiji World News",
              "Reuters World News",
              "Times World News",
              "World News",
              "World News Fiji Times"
            ],
            "creator": [
              "Reuters Reuters"
            ],
            "video_url": null,
            "description": "By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, […]",
            "content": "FILE PHOTO: A general view shows almost dried up Lake Zicksee near Sankt Andrae, as another heatwave is predicted for parts of the country, in Austria, August 12, 2022. REUTERS/Leonhard Foeger/ By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, officially marked on Saturday, has included a week of conservation and clean-up activities around the world, and festivals were due to begin in Rome and Boston on Friday. Thousands were expected to gather in London on Friday to begin four days of events known as the “Big One”, organised by the Extinction Rebellion activist group. A rally was to be staged in Washington urging President Joe Biden to commit to ending fossil fuel use. On Saturday, volunteers will also begin major clean-up campaigns at Lake Dal in India’s Srinigar and Florida’s hurricane-hit Cape Coral. On Thursday, Biden pledged to increase U.S. funding to help developing countries fight climate change and curb deforestation in Brazil’s Amazon rainforest during a meeting with leaders from the world’s largest economies. U.N. Secretary General Antonio Guterres told countries attending Biden’s Major Economies Forum that “a quantum leap in climate action” was required to limit temperature rises to 1.5 degrees Celsius. He warned in a recorded Earth Day message that “we seem hellbent on destruction”. Earth Day this year follows weeks of extreme weather with temperatures hitting a record 45.4 degrees Celsius (113.7 Fahrenheit) in Thailand and another punishing heatwave in India, where at least 13 people died of heatstroke at a ceremony last weekend. Scientists warned this week that killer heatwaves were putting “unprecedented burdens” on India’s agriculture, economy and public health, and undermining the country’s long-term efforts to reduce poverty, inequality and illness. Average global temperatures could hit record highs this year or in 2024, driven by climate change and the anticipated return of the “El Nino” weather phenomenon, climate scientists said on Thursday. (Reporting by David Stanway; Editing by William Mallard)",
            "pubDate": "2023-04-21 23:03:28",
            "image_url": null,
            "source_id": "fijitimes",
            "category": [
              "top"
            ],
            "country": [
              "Fiji"
            ],
            "language": "english"
          },
          {
            "title": "NES: 14 key resolutions reached",
            "link": "https://www.fijitimes.com/nes-14-key-resolutions-reached/",
            "keywords": [
              "Local News",
              "News",
              "Politics",
              "Fiji News",
              "Minister for Finance Professor Biman Prasad",
              "National Economic Summit (NES)",
              "NES: 14 key resolutions reached",
              "Times News"
            ],
            "creator": [
              "Shayal Devi"
            ],
            "video_url": null,
            "description": "As 14 key resolutions were reached upon the conclusion of the two-day National Economic Summit (NES) yesterday, Minister for Finance Professor Biman Prasad hailed the wide cross-section of stakeholders who participated at the event. The resolutions were reached after thorough deliberations carried out through five plenary sessions and 12 thematic working groups. Prof Prasad also […]",
            "content": "Deputy Prime Minister and Minister for Finance Biman Prasad in an interview at the National Economic Summit iin Suva, on Thurs 20 April 2023. Picture: ELIKI NUKUTABU As 14 key resolutions were reached upon the conclusion of the two-day National Economic Summit (NES) yesterday, Minister for Finance Professor Biman Prasad hailed the wide cross-section of stakeholders who participated at the event. The resolutions were reached after thorough deliberations carried out through five plenary sessions and 12 thematic working groups. Prof Prasad also highlighted that the Fiscal Review Committee chair had highlighted the “triple threat” facing the Fiji economy. These are: excessively high Government debt, delayed investment in critical infrastructure and the impact of unforeseen shocks from climate change and other global and local risks. “It has been heartening to see the level of engagement and the willingness of our participants to consider the pressing issues facing our economy,” he said. Prof Prasad reiterated that economic growth was the key – and that the summit was the first step in a united, people-driven approach to achieving a better economic future for all. The resolutions include: • Government’s economic strategy to focus on trusted leadership and good governance, climate change and environmental sustainability and improving the climate for investment. • Sound fiscal discipline in Government in both revenue raising and expenditure to address critical operational and investment needs, while bringing Government debt down. • Better accountability from the legislative, executive and judicial arms of Government to build economic confidence. • Upgrade and prioritise work on human development, in areas of health, education, housing, youth, women and girls and abuse of children, poverty alleviation. • Unleash the potential of rural and outer island areas by infrastructure upgrade and resource provision. • Reform outdated laws involving agriculture. • Need coordinated conservation and better regulation of fisheries to develop marine-based activities. • Upgrade technology based education at all levels. • Increase engagement and empowerment of Fiji’s indigenous population in commerce and business. • Immediately prioritise the upgrade and maintenance of Fiji’s water, sewerage supply and waste management systems in urban centres throughout Fiji, with particular attention to the Suva-Nausori corridor. • Recognise efficient and eco-friendly land, marine and transportation systems critical to Fiji’s sustainable development. • Need for greater electricity capacity and connectivity, focus on renewable and climate resilient energy sources. • Reinvigorate institutional and planning machinery of each ministry and its coordination and linkage to the national strategic development policy. • Continue the 12 thematic working groups as a basis of continued consultation and dialogue.",
            "pubDate": "2023-04-21 22:15:22",
            "image_url": null,
            "source_id": "fijitimes",
            "category": [
              "sports"
            ],
            "country": [
              "Fiji"
            ],
            "language": "english"
          },
          {
            "title": "'Workers demand better': Provincial unions rally ahead of election, stand in solidarity with PSAC pickets",
            "link": "https://calgaryherald.com/news/local-news/provincial-unions-rally-in-support-of-psac-pickets",
            "keywords": [
              "Local News",
              "News"
            ],
            "creator": [
              "Stephanie Babych"
            ],
            "video_url": null,
            "description": null,
            "content": "Workers from a number of labour groups waved their union’s flags and marched in downtown Calgary on Friday afternoon to demand better from the provincial government and stand in solidarity with federal pickets. The rally, led by the Alberta Federation of Labour (AFL), saw hundreds of workers walk from the TELUS Convention Centre to city hall, where representatives from the unions spoke above chants of “workers deserve better,” and “solidarity.” The speakers called for better wages, Canada Pension Plan (CPP) protection and greater support in the face of severe staff shortages. “Employers in this province and the private sector are making record profits. Our provincial government’s coffers are full. Our economy is strong and its prospects for the future are bright. In this context, Alberta workers do not have to lower their expectations,” AFL president Gil McGowan shouted to the crowd. “You do not have to settle for less.” The rally comes just a few weeks before Albertans head to the ballot box. Talk of the approaching provincial election prompted chants of “NDP” from the crowd outside city hall. Gavin McGarrigle, western regional director with Unifor, said representatives from Unifor were proud to stand in solidarity with AFL members. “We’re going to do this the way we have to do it: boots on the ground, every day, every week for the next four weeks. That’s the fastest way to get us all better contracts, is to get rid of this government and get a government by workers and for workers to make sure we make this province better,” McGarrigle said to cheers from the crowd. McGowan said the rally should send a strong message to employers in Alberta’s public and private sectors. Workers in the province should not have to put up with disrespect in the workplace, he said. “Workers demand better,” McGowan said. “For the last year and a half, we’ve been living through a period of unprecedented inflation. The cost of living is way up and wages have not kept up.” Rory Gill, president of the Canadian Union of Public Employees (CUPE) Alberta division, said the labour movement has been revitalized. “There’s a moment in Canada right now, not just in Alberta, where workers are saying, we want better. We want better schools, we want better governance and we want better social services,” said Gill. Asked about the upcoming provincial election, Gill said the NDP has made it clear that their priorities are working people and the problems that everyday working people are facing. “We believe that an NDP government is a government that we as the labour movement can work with,” said Gill. Following the rally at city hall, the workers marched to the Harry Hays Building to join the Public Service Alliance of Canada (PSAC) picket line. PSAC announced a strike Wednesday after failing to reach an agreement with the federal government the day before. The Health Sciences Association of Alberta (HSAA) has said . According to the union, which represents the health-care workers employed by DynaLife, they are looking to get back to the bargaining table after informal mediation was unsuccessful. The impasse could lead to job action. “We’re seeing active privatization of our health care through our EMS, long-term care and our lab services. It is shameful and we must stand our ground. This battle begins now. We fight today, we fight every day. Enough is enough,” Mike Parker, president of the HSAA, said at Friday’s rally. Also represented at the rally were United Food & Commercial Workers Local 401, United Nurses of Alberta, PSAC and the Amalgamated Transit Union Local 583.",
            "pubDate": "2023-04-21 21:49:31",
            "image_url": null,
            "source_id": "calgaryherald",
            "category": [
              "politics",
              "world"
            ],
            "country": [
              "canada"
            ],
            "language": "english"
          },
          {
            "title": "Govt to mitigate rising costs for low income earners",
            "link": "https://fijilive.com/govt-to-mitigate-rising-costs-for-low-income-earners/",
            "keywords": [
              "Featured",
              "News",
              "Ministry of Education",
              "National Economic Summit",
              "Professor Biman Prasad"
            ],
            "creator": [
              "Ilaitia Ravuwai"
            ],
            "video_url": null,
            "description": "Deputy Prime Minister Prof Biman Prasad has noted an urgent demand from the people for solutions to their daily challenges, including the rising cost of living. Speaking to the media after National Economic Summit Communiqué was issued; Prof Prasad says they will pursue the most sustainable solution to improving cost of living challenges that must […]",
            "content": "Deputy Prime Minister Prof Biman Prasad has noted an urgent demand from the people for solutions to their daily challenges, including the rising cost of living. Speaking to the media after National Economic Summit Communiqué was issued; Prof Prasad says they will pursue the most sustainable solution to improving cost of living challenges that must come from rising incomes sourced through economic growth. In the short term, he said measures, such as directed and targeted assistance for lower-income households, could be improved with increased Government revenue created by a growing economy. 14 key resolutions have also been agreed to that need to be addressed immediately. They include a call on Government to immediately prioritize the upgrading and maintenance of Fiji’s water, sewerage supply and waste management systems in urban centres throughout Fiji, with particular attention to the Suva-Nausori corridor. “Government noted the critical need for Government’s economic strategy to be focused on trusted leadership and good governance, climate change and environmental sustainability and improving the climate for investment and business to thrive; reinforcing the need for sound fiscal discipline in Government in both revenue raising and expenditure to address critical operational and investment needs, to bring Government debt down to fiscally manageable and responsible levels and to engage actively with development partners to capitalise on funding and development opportunities; and noted that good governance demanded better accountability from the legislative, executive and judicial arms of Government to build economic confidence – the legislature to use its processes to build consensus and consistency of policy on important long-term issues such as health, education and key industries,” he added. The National Economic Summit ended yesterday with 14 recommendations and 21-page resolutions.",
            "pubDate": "2023-04-21 21:13:25",
            "image_url": null,
            "source_id": "fijilive",
            "category": [
              "top"
            ],
            "country": [
              "Fiji"
            ],
            "language": "english"
          },
          {
            "title": "Biden to meet Philippine President at White House on May 1",
            "link": "https://www.fijitimes.com/biden-to-meet-philippine-president-at-white-house-on-may-1/",
            "keywords": [
              "News",
              "World",
              "Biden to meet Philippine President at White House on May 1",
              "Fiji Times World News",
              "Fiji World News",
              "Reuters World News",
              "Times World News",
              "World News",
              "World News Fiji Times"
            ],
            "creator": [
              "Reuters Reuters"
            ],
            "video_url": null,
            "description": "WASHINGTON/MANILA (Reuters) – U.S. President Joe Biden will meet his Philippine counterpart Ferdinand Marcos Jr at the White House on May 1 to discuss deepening economic cooperation and the Indo-Pacific region, Manila and Washington said on Friday. The treaty allies have enjoyed warmer ties since Marcos took office last June, reversing his predecessor’s anti-U.S. stance […]",
            "content": "U.S. President Joe Biden convenes the fourth virtual leader-level meeting of the Major Economies Forum (MEF) on Energy and Climate at the White House in Washington, U.S., April 20, 2023. REUTERS/Kevin Lamarque WASHINGTON/MANILA (Reuters) – U.S. President Joe Biden will meet his Philippine counterpart Ferdinand Marcos Jr at the White House on May 1 to discuss deepening economic cooperation and the Indo-Pacific region, Manila and Washington said on Friday. The treaty allies have enjoyed warmer ties since Marcos took office last June, reversing his predecessor’s anti-U.S. stance and overtures towards China, Washington’s rival in the region. The two leaders will also discuss further economic cooperation, White House spokesperson Karine Jean-Pierre said in a statement. “During the visit, President Biden will reaffirm the United States’ ironclad commitment to the defense of the Philippines, and the leaders will discuss efforts to strengthen the longstanding U.S.-Philippines alliance,” the statement said. In what will be his second trip to the United States in less than a year, the presidential palace said on Friday that Marcos will travel to Washington from April 30 to May 4 to meet Biden and key cabinet officials. “It will substantively progress efforts to further deepen…political ties, to bring about lasting socio-economic partnerships, as well as to enhance defence and security cooperation,” the palace said. Marcos will seek closer partnership in agriculture, energy, climate change, digital transformation, humanitarian assistance and disaster relief, supply chains, and infrastructure, it added. The Philippines earlier this month identified four additional military bases that the U.S. may access amid shared concerns about China’s growing might. China’s ambassador to Manila last week accused the Philippines of “stoking the fire” of regional tensions by offering the expanded base access to the U.S. More than 17,000 Philippine and U.S. soldiers are currently conducting their largest ever joint military drills in the Southeast Asian country, drawing criticism from China. (Reporting by Eric Beech in Washington and Costas Pitas and Dan Whitcomb in Los Angeles; Additional Reporting by Neil Jerome Morales in Manila)",
            "pubDate": "2023-04-21 21:06:46",
            "image_url": null,
            "source_id": "fijitimes",
            "category": [
              "sports"
            ],
            "country": [
              "Fiji"
            ],
            "language": "english"
          },
          {
            "title": "UK Bill torments Zimbabwe",
            "link": "https://mbaretimes.com/2023/04/zimbabwe-12/",
            "keywords": [
              "Zimbabwe News",
              "UK",
              "Zimbabwe"
            ],
            "creator": [
              "Kuda M"
            ],
            "video_url": null,
            "description": "BOLD moves by the British Parliament to enact legislation shutting African wildlife trophies out of that market have shaken Zimbabwean authorities, as fears mount that the country’s major tourism plan may flop. Authorities told Zimbabwe Independent this week that there were worried that once the Bill sails through, an ambitious tourism industry plan to grow … The post UK Bill torments Zimbabwe appeared first on Mbare Times.",
            "content": "BOLD moves by the British Parliament to enact legislation shutting African wildlife trophies out of that market have shaken Zimbabwean authorities, as fears mount that the country’s major tourism plan may flop. Authorities told Zimbabwe Independent this week that there were worried that once the Bill sails through, an ambitious tourism industry plan to grow sector revenue to US$5 billion by 2025 would be thrown into jeopardy. Revenues into the hunting sector alone are projected to hit US$9 million this year, from US$3 million in 2022, driven by increasing arrivals in the aftermath of the pandemic. But the Hunting Trophies (Import Prohibition) Bill, introduced in the UK’s House of Commons on June 15 last year, appears to be a major hurdle. It prohibits the importation of hunting trophies of certain animals listed by the Convention on International Trade in Endangered Species of Wild Fauna and Flora as vulnerable. British legislators recently voted to support the ban. The Bill, which has also sent shivers across southern Africa’s tourism reliant economies, also prevents British hunters from importing the body parts of lions, elephants and giraffes – the animals that fetch significant foreign currency revenue for Zimbabwe. In an interview with the Independent, Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson Tinashe Farawo said there were fears other markets may follow suit. He said authorities were concerned that the Bill disregarded Zimbabwe’s unique situation where targeted species’ populations were growing. “Zimbabwe has demonstrated that a ‘well-managed’ trophy hunting system is an effective conservation tool whose benefits also spill over to communities living with dangerous wildlife,” Farawo said.”Contrary to what some countries have been made to believe, our desire to trade in wildlife has never taken precedence over our responsibility to maintain the integrity of ecosystems.” He said the ban had also disregarded the fact that Zimbabwe had in place a successful wildlife management system. “It is important for our wildlife to have direct economic value to our local people, beyond the non-consumptive tourism value chain. If the Bill goes on to become law, it has a significant negative effect on Zimbabwe’s foreign currency inflows and will certainly leave rural communities worse off,” Farawo said. The United States has also been drafting similar legislation to ban the importation of endangered species to strengthen countries’ conservation efforts. “Other European countries will almost certainly pass similar laws hence magnifying the consequences of such a decision. This is a decision driven by a neo-colonial agenda far divorced from conservation interests,” he said. In an interview with the Independent two weeks ago, Safari Operators Association of Zimbabwe (SOAZ) president Emmanuel Fundira said curbs to international trade in trophies would hurt the hunting sector. Fundira said through the Bill, a form of “re-colonisation” was sweeping through African markets this year. He said the industry was being ‘penalised’, instead of being recognised for its conservation efforts. This year’s trade is likely to be bolstered by firming demand from Russia, where oligarchs have been forced to scout for alternative hunting markets after being slapped with sanctions in multiple destinations since Moscow’s conflict with Ukraine exploded last year. “(We are) facing the usual challenges from the West where, with regret, our successes in conservation continue to be penalised instead of being accorded appropriate reward,” the Soaz boss said. “Policy-makers in various source markets, in particular the USA and United Kingdom, continue to advocate and push for retrogressive legislation, which does not take into consideration community empowerment and protection of livelihoods through sustainable use. Simply put, (it is) a form of re-colonisation,” Fundira, chief executive officer at Astoc Leisure Group, said. Source: bulawayo24 PRESIDENT Emmerson Mnangagwa yesterday said he will proclaim election date next month, ending speculation that the polls might be postponed to allow for formation of a coalition government. Speaking at the official opening of the refurbished Mhondoro Hospital in Mubaira, Mashonaland West province, Mnangagwa said: “I am the only one who knows the date of elections, I will be announcing that date at the end of next month.” Learn more",
            "pubDate": "2023-04-21 20:30:19",
            "image_url": null,
            "source_id": "mbaretimes",
            "category": [
              "top"
            ],
            "country": [
              "Zimbabwe"
            ],
            "language": "english"
          },
          {
            "title": "Canadian consumers pull back on spending amid high prices, interest rates: Experts",
            "link": "https://www.vicnews.com/business/canadian-consumers-pull-back-on-spending-amid-high-prices-interest-rates-experts/",
            "keywords": [
              "Business",
              "Retail"
            ],
            "creator": [
              "The Canadian Press"
            ],
            "video_url": null,
            "description": "Retail sales slipped 0.2 per cent to $66.3 billion in February",
            "content": "Canadian consumers are pulling back on spending as rising prices and high interest rates appear to be taking a toll on retail sales. Retail sales slipped 0.2 per cent to $66.3 billion in February amid a drop in spending at general merchandise stores and gasoline stations and fuel vendors, Statistics Canada said Friday. The early estimate for March also points to an even steeper decline of 1.4 per cent, though the agency cautioned the figure would be revised. “We’re starting to see consumers tighten their belts,” retail analyst Bruce Winder said. “Canadian consumers are incredibly cautious right now.” Economists have warned of a lag between rising prices and high interest rates and the affect on the economy. While the Bank of Canada held its key lending rate at 4.50 per cent at its most recent rate decision, it is up from 0.25 per cent at the start of 2022. “It is clear that consumer spending behaviour has been impacted by the rapid rise in interest rates even as the economy as a whole has generally outperformed expectations,” Andrew Grantham, senior economist with CIBC Capital Markets, said in a client note. Still, the pull back in consumer spending could help ease inflation even further, he said. “This sluggishness in spending should help keep goods price inflation under control (assuming supply chain issues don’t worsen again), allowing the Bank of Canada to stay on hold for the remainder of this year before gradual cuts start early in 2024,” Grantham said. The annual rate of inflation in Canada dropped to 4.3 per cent in March, but grocery prices climbed 9.7 per cent on a year-over-year basis, Statistics Canada said Tuesday. For February, retail sales were down in four of the nine subsectors as sales at gasoline stations and fuel vendors fell 5.0 per cent for the month and general merchandise retailers lost 1.6 per cent. Meanwhile, sales at motor vehicle and parts dealers rose 0.9 per cent in February. Core retail sales — which exclude gasoline stations and fuel vendors and motor vehicle and parts dealers — increased 0.1 per cent helped by a 4.4 per cent gain in sales at clothing, clothing accessories, shoes, jewelry, luggage and leather goods retailers. “Consumers are picking are choosing where they cut spending,” Winder said. “More companies are quietly nudging workers back into the office, so that could be helping spending in some areas.” In volume terms, a measure that adjusts for the impact of inflation, overall retail sales fell 0.7 per cent in February. The Bank of Canada’s business outlook and consumer expectations surveys released earlier this month found that the economy has been relatively resilient amid high interest rates but that’s expected to change in the coming months. With a potential recession looming, the surveys showed consumers expect to pull back on spending and businesses anticipate sales will slow. The Bank of Canada found almost half of firms have adjusted their business plans to account for a recession while consumers are planning to spend less on activities such as travel and going to restaurants over the next year. —Brett Bundale, The Canadian Press READ MORE: Retail spending in Canada shows signs of slowdown amid higher inflation, interest Retail",
            "pubDate": "2023-04-21 20:30:00",
            "image_url": "https://www.vicnews.com/wp-content/uploads/2023/04/32496433_web1_20230421080452-6442878569ee68b8cda9ca0fjpeg-1024x688.jpg",
            "source_id": "vicnews",
            "category": [
              "top"
            ],
            "country": [
              "canada"
            ],
            "language": "english"
          },
          {
            "title": "National Bank CEO worried about effect of remote work on downtown Montreal",
            "link": "https://www.thestar.com/business/2023/04/21/national-bank-ceo-worried-about-effect-of-remote-work-on-downtown-montreal.html",
            "keywords": null,
            "creator": [
              "Stéphane Rolland - The Canadian Press"
            ],
            "video_url": null,
            "description": null,
            "content": "MONTREAL - The CEO of National Bank plans to maintain a flexible approach toward his employees working in the office, even though he’s worried about the impact remote work is having on the vitality of downtown Montreal. Laurent Ferreira said he’s worried about the effect the widespread adoption of telecommuting is having on small businesses in Montreal’s downtown business district. “I’m concerned for downtown Montreal and I think the business community has a very great responsibly (to ensure) the dynamism of Montreal’s ecosystem,” he said in an interview Friday, during the bank’s annual shareholders meeting. But, for now, Ferreira doesn’t want to impose anything on his teams. “We want a flexible approach. We want the teams to organize themselves and for them to decide when they need to meet, work together,” he said. It’s an approach that contrasts with that of the Royal Bank of Canada, which has asked its employees to work from the office three or four days a week, depending on the nature of their work. National Bank is suggesting workers come in 40 per cent of the time, though Ferreira said he would like a “better balance” that sees employees coming in more frequently. But he said telecommuting hasn’t had a negative affect on the productivity of the bank’s employees. Around 12,000 people work at National Bank’s downtown Montreal headquarters. The bank will begin gradually moving into a new 40-storey tower during the second half of the year. The project, announced in 2018, represents an investment of more than half a billion dollars. Ferreira told the shareholder meeting he expects the economy to slow in 2023 and 2024, but noted that the job market remains resilient. National Bank is in an enviable position to deal with an economic slowdown, Ferreira said, with higher capital reserves than its peers. “Because we’re in an advantageous position, that might allow us to gain market share,” he said. National Bank’s capital ratios were at 12.6 per cent on Jan. 31. “It’s more than the required minimum of 11 per cent and more than most peers when you take into account their acquisition plans,” said Darko Mihelic, an analyst at RBC Capital Markets. National Bank wants to grow organically, without acquisitions, in other Canadian provinces and has identified commercial banking and wealth management as its main avenues for growth. “That’s where we’re putting the emphasis, especially outside Quebec, but you understand that commercial and wealth management clients also need a bank account and a credit card, so it’s all related,” he said. Like the CEOs of other large Canadian banks, Ferreira was asked about the institution’s environmental policies during the shareholders meeting. The bank does not want to completely divest from the oil and gas sector, but want to support companies that are making efforts to decarbonize their operations. This report by The Canadian Press was first published April 21, 2023. Companies in this story: (TSX:NA) Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free) Sign In Register",
            "pubDate": "2023-04-21 20:05:10",
            "image_url": null,
            "source_id": "thestar",
            "category": [
              "business"
            ],
            "country": [
              "canada"
            ],
            "language": "english"
          },
          {
            "title": "How to benefit from gold investing right now",
            "link": "https://www.cbsnews.com/news/how-to-benefit-from-gold-investing-right-now/",
            "keywords": null,
            "creator": null,
            "video_url": null,
            "description": "If you're facing uncertainty in today's market, gold could help in multiple ways. Here's how.",
            "content": "Gold can help provide stability in an uncertain economic environment. Getty Images/iStockphoto This year, many investors may be feeling plagued by ongoing inflated prices, high interest rates and a volatile stock market. While uncertainty can come and go , you can benefit from securing your investment portfolio to best weather any storms ahead. That's one reason why gold is a popular investment option . It's appealing as a portfolio diversifier as well as a hedge against inflation and counterbalance to more tumultuous markets. If you're considering adding gold as an investment, start by comparing gold options . How to benefit from gold right now Here are a couple of reasons you could benefit from investing in gold today: Diversify your portfolio Diversification is one of the best ways to protect your investments over the long term. And a great way to diversify is with asset types that tend to react differently from each other over time. Gold is commonly sought-after by uncertain investors, thanks to its often inverse performance to other types of assets. Take last year, for example. While stock prices went down on the whole — the S&P 500 index fell by about 19% over the year — gold prices remained steady over the same period. Not every year will look like 2022, and the stock market's potential highs can help boost your portfolio over the long run. But diversification helps you weather periods when traditional markets are down. \"Rising concerns around the economy is becoming an increasing risk,\" says Samuel Leach, an investing expert and founder of Samuel & Co. Trading, pointing to factors like rising interest rates and stock market turbulence. If you're worried about economic uncertainty today, then start exploring your gold investing options here . Stability amid inflation Not only are the markets volatile, but inflation has kept prices up over the past year. And though data shows consumers are feeling relief in some areas, everything from utilities to food remains high . Inflation also causes a decline in the value of the dollar, since its buying power goes down. Think, for example, about the last time you went to the grocery store and it cost more to buy a carton of eggs than the time before, or prices at the gas pump were up by more than a few cents. There's one bright spot amid ongoing price pressures for some investors, though. Gold prices tend to do well even as the value of the dollar falls during inflationary periods. In fact, gold prices today are near their all-time high. Consider the relationship between the price of the dollar and the price of gold over the past six months. Driven by bank failures earlier this year, high inflation and interest rates, the dollar's price value has fallen by around 9%, while gold has risen by about 20% in the same period. While the value of gold can drop over time too, its price stability generally makes it a good hedge against the current inflationary economic environment. The bottom line Uncertain economic times can lead many investors to consider the stability of an investment like gold . Gold could make sense for your portfolio and overall financial plan if you're looking for a way to diversify and weather ongoing inflation and volatility. There are plenty of ways to invest, too. Gold IRAs and gold ETFs are two common investment options, but you may also choose to hold physical gold bullion or gold futures . Before making any new investment, consider how it may affect your long-term goals. Learn more about investing in gold with a free information kit . MoneyWatch: Managing Your Money More Is life insurance worth it? How to use your home equity this summer How to benefit from gold investing right now Why you should get travel insurance, according to experts Following Apple's savings account news, is now the right time to open an account? More",
            "pubDate": "2023-04-21 20:01:14",
            "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/04/21/1e930f7f-1fe0-480b-b1a6-2259a1e3c2f7/thumbnail/60x60/314499a001fe0a6efe2a706720759445/gettyimages-1217504901.jpg",
            "source_id": "cbsnews",
            "category": [
              "top"
            ],
            "country": [
              "united states of america"
            ],
            "language": "english"
          }
    ],
    "technology": [
        {
          "title": "This week in news: 17-21 April",
          "link": "https://7news.com.au/lifestyle/motoring/this-week-in-news-17-21-april-c-10421820",
          "keywords": null,
          "creator": [
            "Jade Credentino"
          ],
          "video_url": null,
          "description": "Here are some of the key developments from the past week in Australian automotive news - in case you missed them.",
          "content": "We publish a ton of car news stories during the working week, and it can be tough to keep up with everything – which is the rationale behind this weekend list. In short, here are some key articles from our news desk since Monday of this week summarised, just in case you missed them at the time. For more Motoring related news and videos check out The Federal Chamber of Automotive Industries (FCAI) has released 2022 emissions results for each individual brand. In its on the voluntary emissions reduction standard, it confirmed the heavy SUV and light commercial vehicle target (MC + NA) had missed its target while passenger cars and light SUVs (MA) reached it. Now, it has confirmed which brands met their target and which ones fell short. FULL STORY: The 2023 Mahindra Scorpio six-seat body-on-frame SUV is on sale in Australia from April 20 with test drives now available. The two-variant range starts at $41,990 drive-away, and extends to $44,990 drive-away until June 30, 2023. It’s unclear what prices will change to after this time. This pricing of the entry-level Scorpio Z8 undercuts the likes of the by $7000, by $10,750, and the by $18,100. FULL STORY: SAIC Motor’s Maxus brand, known here as LDV, has revealed the new electric eDeliver 7 mid-sized van with two battery options and more than 360km of range. It will go on sale in the UK market in the second half of the year. Ateco, the local distributor for LDV, it will launch a new mid-sized cargo van in the fourth quarter of this year with both combustion and electric powertrains and a choice of three roof options, though it hasn’t confirmed any other details. The eDeliver7 seems a logical fit. FULL STORY: Jaguar Land Rover is dead, all hail the carmaker known as JLR. To go along with this change, the role of the Land Rover marque will be diminished. Adrian Mardell, JLR CEO since the start of 2023, announced the change today as he outlined the company’s electric vehicle strategy for the coming decade. As part of an accelerated version of the strategy launched during the two-year reign of , Jaguar Land Rover will rename itself as JLR. FULL STORY: Jaguar Land Rover – now known as JLR – is accelerating its electric car push, and its next-generation of mid-sized models will now be electric-only propositions. These crossovers will be based on the upcoming Electrified Modular Architecture (EMA), which was previously touted as an electric-first platform that would also support internal combustion engines (ICE) and plug-in hybrid (PHEV) functionality. As part the updated Reimagine strategy unveiled overnight, JLR will invest £15 billion ($28 billion) over the next five years on new model development and production, with much of the money spent on electric vehicles. FULL STORY: What comes after the Polestar 1, 2, and 3? The Polestar 4, of course. Revealed at the Shanghai motor show, the 4 is slightly smaller than revealed in 2022. Launch timing for Australia hasn’t been confirmed; Polestar says launch details for global markets will be confirmed in 2024. FULL STORY: The second generation of the Lexus LM luxury people mover has been revealed, and it’s coming to Australia. Lexus says local launch timing, specification and pricing will be announced closer to the vehicle’s launch. It has previously indicated it will launch for the brand by mid-2024, so the LM should therefore arrive over the next 12 months or so. FULL STORY: Great Wall Motor has just revealed a dream ute with its six-wheeler CyberPickup concept at the 2023 Shanghai motor show. The plug-in hybrid Cannon 6×6 ute – which has a 50km pure electric range – has certainly caught our attention and will no doubt be highly desirable for anyone that needs the extra load and towing capacity. CarExpert has been told the vehicle has already been homologated for the Chinese market for 3.5-tonne towing with potential to go up to 6 tonnes for special purposes. FULL STORY: Ford has confirmed the as-yet unrevealed electric Puma small SUV will join the e-Transit, e-Transit Custom, and Mustang Mach-E in Australian showrooms. Ford Australia boss Andrew Birkic says the is the final step in a plan to launch five electrified vehicles Down Under before the end of 2024. Although it will technically achieve that goal, the won’t be on sale come the end of 2023 as Ford kills the model locally. FULL STORY: Ford won’t have a rival to the best-selling and in Australia by the end of 2023. The brand has confirmed it’ll axe the locally before the end of this year, just over 20 years after it debuted Down Under. Both the petrol model and its plug-in hybrid twin will be axed. “We don’t make those nameplate decisions and those brand decisions lightly. We go through a very rigorous process, with multiple factors that go into making those decisions,” Ford Australia boss Andrew Birkic told media. “We believe now is the right time.” FULL STORY: Porsche’s biggest SUV (for now) has been overhauled for 2024. Although it’s technically a mid-life update on the exisiting model which debuted in 2019, Porsche describes this as “one of the most extensive product upgrades in the history of Porsche”. Inspired by the , the new-look features revised engines, suspension and handling improvements, as well as an updated dashboard that features a digital instrument cluster and optional front passenger display. FULL STORY: We already knew what it would look like thanks to patent images, spy photos, and a Chinese Ministry of Industry and Information Technology filing, but here it is: the production-spec MG Cyberster. MG has released a series of images of the electric roadster, which takes the stage at this week’s Shanghai motor show two years after it was first previewed in concept form. “I can confirm that we will be bringing the MG Cyberster to the Australian and New Zealand market and hope to have more exciting news to share around this in due course,” said a spokesperson from MG Motor Australia. FULL STORY: BMW’s flagship electric car has a new flagship of its own, and it’s the brand’s most powerful electric vehicle yet. The features a dual-motor all-wheel drive powertrain, with the rear motor producing 360kW of power and the front producing 190kW. Total system torque is 1015Nm in Sport mode, with total system power of 485kW and torque of 1100Nm when M Launch Control or the M Sport Boost function is activated. FULL STORY:",
          "pubDate": "2023-04-21 23:00:55",
          "image_url": "https://images.7news.com.au/publication/C-10421820/e8904ee3d534bfd118675404580a5d7e7fb04aa0-16x9-x0y0w3953h2224.jpg",
          "source_id": "7news",
          "category": [
            "entertainment"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "IPL 2023: CSK skipper MS Dhoni admits he's in 'last phase of career' after win over SRH",
          "link": "https://www.firstpost.com/firstcricket/sports-news/ipl-2023-csk-skipper-ms-dhoni-admits-hes-in-last-phase-of-career-after-win-over-srh-12489732.html",
          "keywords": [
            "First Cricket News"
          ],
          "creator": [
            "FirstCricket Staff"
          ],
          "video_url": null,
          "description": "IPL 2023: CSK skipper MS Dhoni admits he's in 'last phase of career' after win over SRH",
          "content": "Cricket IPL 2023: CSK skipper MS Dhoni admits he's in 'last phase of career' after win over SRH Dhoni made the statement that has since set social media abuzz following CSK's seven-wicket victory over Sunrisers Hyderabad (SRH) at the MA Chidambaram Stadium in Chennai. FirstCricket Staff April 22nd, 2023 4:21:50 IST MS Dhoni at the MA Chidambaram Stadium in Chennai during Match 29 of IPL 2023 between Chennai Super Kings and Sunrisers Hyderabad. Sportzpics Chennai Super Kings (CSK) skipper MS Dhoni dropped a major hint over his future in the Indian Premier League (IPL) on Friday, stating that he indeed was in the “last phase of his career”. IPL 2023: Full coverage | Points table | Schedule | Results | Orange Cap | Purple Cap​ Dhoni made the statement that has since set social media abuzz following CSK’s seven-wicket victory over Sunrisers Hyderabad (SRH) at the MA Chidambaram Stadium in Chennai. “All said and done, it’s the last phase of my career, however long I play. After two years, the fans have had the opportunity to come here and watch, feels good to be here. Crowd has given us a lot of love and affection,” Dhoni said in the post-match presentation after Chennai collected their fourth win of the season in six matches. In his own style, @msdhoni describes yet another successful day behind the stumps 👏 And along with it, shares a special Rahul Dravid story and admiration for @sachin_rt 😃 #TATAIPL | #CSKvSRH pic.twitter.com/4gL8zU9o9v — IndianPremierLeague (@IPL) April 21, 2023 Dhoni, who brought the curtains down on a glittering international career in 2020, continues to ply his trade in the premier T20 league and remains the undisputed leader of the ‘Yellow Army’, whom he has led to four title victories. MSD had briefly passed captaincy to all-rounder Ravindra Jadeja at the start of the 2022 season, but eventually reinstated himself following a string a poor results. The 41-year-old additionally described his catch to dismiss his Sunrisers counterpart Aiden Markram as “fantastic” given that he managed to pull it off despite being in an awkward position. “I was in such a wrong position. Just because we wear gloves, people think it’s easy. I felt it was a fantastic catch. Long time back I still remember one game – Rahul Dravid was keeping and he caught one like that. Once you get old, that’s the only time you get experience. Unless you’re Sachin paaji and start playing at 16-17. Definitely old, can’t shy away from that,” Dhoni added in the post-match chat with Harsha Bhogle. SRH skipper Markram, meanwhile, expressed disappointment over the ‘Orange Army’ getting restricted to a sub-par total and going on to suffer a second defeat in a row that has ensured they stay ninth in a 10-team table. “We had the plans but unfortunately couldn’t execute them. It is about taking on the bowlers in the powerplay, we need to stick to our aggressive approach. We have to look in and see how to get better with the bat, one or two guys need to put their hands up with the bat,” the South African said. As for Jadeja, who bagged the Player of the Match award for his haul of 3/22, the plan at Chepauk was to not bowl too full and aim for the stumps. “Coming to Chennai, looking at the wicket gives me a lot of happiness. You know it’s going to turn. I had in my mind to not bowl too full. Important to keep wicket to wicket. CSK fans always support us, no matter we win or lose,” said the left-arm spinner. Read all the Latest News , Trending News , Cricket News , Bollywood News , India News and Entertainment News here. Follow us on Facebook , Twitter and Instagram . Updated Date: April 22, 2023 04:21:50 IST Tags: Cricket Csk Vs Srh Ipl 2023 Ipl 2023 Csk Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.",
          "pubDate": "2023-04-21 22:51:50",
          "image_url": "https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/MS-Dhoni-CSK-SRH-IPL-2023-Sportzpics-640.jpg",
          "source_id": "firstpost",
          "category": [
            "sports"
          ],
          "country": [
            "india"
          ],
          "language": "english"
        },
        {
          "title": "NES: 14 key resolutions reached",
          "link": "https://www.fijitimes.com/nes-14-key-resolutions-reached/",
          "keywords": [
            "Local News",
            "News",
            "Politics",
            "Fiji News",
            "Minister for Finance Professor Biman Prasad",
            "National Economic Summit (NES)",
            "NES: 14 key resolutions reached",
            "Times News"
          ],
          "creator": [
            "Shayal Devi"
          ],
          "video_url": null,
          "description": "As 14 key resolutions were reached upon the conclusion of the two-day National Economic Summit (NES) yesterday, Minister for Finance Professor Biman Prasad hailed the wide cross-section of stakeholders who participated at the event. The resolutions were reached after thorough deliberations carried out through five plenary sessions and 12 thematic working groups. Prof Prasad also […]",
          "content": "Deputy Prime Minister and Minister for Finance Biman Prasad in an interview at the National Economic Summit iin Suva, on Thurs 20 April 2023. Picture: ELIKI NUKUTABU As 14 key resolutions were reached upon the conclusion of the two-day National Economic Summit (NES) yesterday, Minister for Finance Professor Biman Prasad hailed the wide cross-section of stakeholders who participated at the event. The resolutions were reached after thorough deliberations carried out through five plenary sessions and 12 thematic working groups. Prof Prasad also highlighted that the Fiscal Review Committee chair had highlighted the “triple threat” facing the Fiji economy. These are: excessively high Government debt, delayed investment in critical infrastructure and the impact of unforeseen shocks from climate change and other global and local risks. “It has been heartening to see the level of engagement and the willingness of our participants to consider the pressing issues facing our economy,” he said. Prof Prasad reiterated that economic growth was the key – and that the summit was the first step in a united, people-driven approach to achieving a better economic future for all. The resolutions include: • Government’s economic strategy to focus on trusted leadership and good governance, climate change and environmental sustainability and improving the climate for investment. • Sound fiscal discipline in Government in both revenue raising and expenditure to address critical operational and investment needs, while bringing Government debt down. • Better accountability from the legislative, executive and judicial arms of Government to build economic confidence. • Upgrade and prioritise work on human development, in areas of health, education, housing, youth, women and girls and abuse of children, poverty alleviation. • Unleash the potential of rural and outer island areas by infrastructure upgrade and resource provision. • Reform outdated laws involving agriculture. • Need coordinated conservation and better regulation of fisheries to develop marine-based activities. • Upgrade technology based education at all levels. • Increase engagement and empowerment of Fiji’s indigenous population in commerce and business. • Immediately prioritise the upgrade and maintenance of Fiji’s water, sewerage supply and waste management systems in urban centres throughout Fiji, with particular attention to the Suva-Nausori corridor. • Recognise efficient and eco-friendly land, marine and transportation systems critical to Fiji’s sustainable development. • Need for greater electricity capacity and connectivity, focus on renewable and climate resilient energy sources. • Reinvigorate institutional and planning machinery of each ministry and its coordination and linkage to the national strategic development policy. • Continue the 12 thematic working groups as a basis of continued consultation and dialogue.",
          "pubDate": "2023-04-21 22:15:22",
          "image_url": null,
          "source_id": "fijitimes",
          "category": [
            "sports"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "Knee surgery patients benefit from groundbreaking new technology",
          "link": "https://www.skynews.com.au/lifestyle/health/knee-surgery-patients-benefit-from-groundbreaking-new-technology/video/ef039029a32481a4e8610e00e5b88388",
          "keywords": [
            "Health",
            "Lifestyle",
            "fb",
            "health",
            "lifestyle",
            "msn",
            "yt"
          ],
          "creator": [
            ""
          ],
          "video_url": null,
          "description": "Osteoarthritis is one of the primary causes of painful knees, damaging the bone and making everyday activities more difficult as we age. However, with new technology, it's never too late for older Queenslanders to consider surgery and experience better recovery outcomes.",
          "content": "Osteoarthritis is one of the primary causes of painful knees, damaging the bone and making everyday activities more difficult as we age. However, with new technology, it’s never too late for older Queenslanders to consider surgery and experience better recovery outcomes.",
          "pubDate": "2023-04-21 22:10:53",
          "image_url": null,
          "source_id": "skynewsau",
          "category": [
            "health"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "IPL 2023: Conway's unbeaten 77 helps CSK defeat SRH in Chennai",
          "link": "https://www.firstpost.com/firstcricket/sports-news/ipl-2023-conways-unbeaten-77-helps-csk-defeat-srh-in-chennai-12489552.html",
          "keywords": [
            "First Cricket News"
          ],
          "creator": [
            "FirstCricket Staff"
          ],
          "video_url": null,
          "description": "IPL 2023: Conway's unbeaten 77 helps CSK defeat SRH in Chennai",
          "content": "Cricket IPL 2023: Conway's unbeaten 77 helps CSK defeat SRH in Chennai Chennai Super Kings chased down the 135-run target set by Sunrisers Hyderabad at Chepauk with seven wickets and eight deliveries to spare. FirstCricket Staff April 22nd, 2023 2:43:19 IST Devon Conway raises his bat after bringing up his third consecutive half-century during CSK’s home game against SRH. Sportzpics SRH opener Harry Brook plays a scoop shot against CSK. Sportzpics CSK skipper MS Dhoni collects a catch to dismiss SRH counterpart Aiden Markram during Match 29 of IPL 2023 in Chennai. Sportzpics CSK skipper MS Dhoni runs Washington Sundar out with a direct hit off the last ball of the SRH innings in Chennai. Sportzpics Tamil Nadu Chief Minister MK Stalin watches the Chennai Super Kings vs Sunrisers Hyderabad match along with his wife at the MA Chidambaram Stadium in Chennai. Sportzpics Openers Devon Conway and Ruturaj Gaikwad stitched a match-winning stand worth 87 to setup a comfortable victory for CSK over SRH. Sportzpics Ambati Rayudu is clean bowled off Mayank Markande’s bowling with CSK on the verge of victory over SRH. Sportzpics Updated Date: April 22, 2023 02:43:19 IST Tags: Cricket Ipl 2023 Ipl 2023 Csk Ipl 2023 Photos Find latest and upcoming tech gadgets online on Tech2 Gadgets. Get technology news, gadgets reviews & ratings. Popular gadgets including laptop, tablet and mobile specifications, features, prices, comparison.",
          "pubDate": "2023-04-21 21:13:19",
          "image_url": "https://images.firstpost.com/fpimages/380x285/fixed/jpg/2023/04/Devon-Conway-fifty-CSK-SRH-Sportzpics-640.jpg",
          "source_id": "firstpost",
          "category": [
            "sports"
          ],
          "country": [
            "india"
          ],
          "language": "english"
        },
        {
          "title": "Most actively traded companies on the Toronto Stock Exchange",
          "link": "https://www.thestar.com/business/2023/04/21/most-actively-traded-companies-on-the-toronto-stock-exchange.html",
          "keywords": null,
          "creator": [
            "The Canadian Press"
          ],
          "video_url": null,
          "description": null,
          "content": "TORONTO - Some of the most active companies traded Friday on the Toronto Stock Exchange: Toronto Stock Exchange (20,693.15, up 22.34): B2Gold Corp. (TSX:BTO). Materials. Up four cents, or 0.72 per cent, to $5.59 on 11.3 million shares. Royal Bank of Canada. (TSX:RY). Financials. Up 55 cents, or 0.41 per cent, to $135.30 on 6.4 million shares. Toronto-Dominion Bank. (TSX:TD). Financials. Up five cents, or 0.06 per cent, to $83.55 on 6.1 million shares. Algonquin Power & Utilities Corp. (TSX:AQN). Utilities. Up 42 cents, or 3.86 per cent, to $11.31 on 5.8 million shares. BlackBerry Limited. (TSX:BB). Technology. Unchanged at $5.68 on 5.3 million shares. Suncor Energy Inc. (TSX:SU). Energy. Down four cents, or 0.1 per cent, to $41.20 on 5.3 million shares. Companies in the news: TC Energy Corporation.(TSX:TRP). Energy. Down 26 cents, or 0.46 per cent, to $55.78 — TC Energy Corp. says a third-party investigation into an oil spill from the company’s Keystone pipeline in December has concluded the incident was caused by a crack in a weld that occurred at the time of the pipeline’s construction. The Calgary-based company says the affected pipe segment was subjected during construction to “inadvertent bending stresses,” initiating a small crack that progressed over time to pipe failure after a decade of operations. National Bank of Canada.(TSX:NA). Financials. Up 24 cents, or 0.24 per cent, to $99.22 — The CEO of National Bank says he’s worried about the impact remote work is having on the vitality of downtown Montreal, but plans to maintain a flexible approach toward his employees working in the office. Laurent Ferreira said in an interview he’s worried about the effect the widespread adoption of telecommuting is having on small businesses downtown and believes the business community has a responsibility toward the city’s downtown. While the Royal Bank of Canada has asked its employees to work from the office three or four days a week, National Bank is suggesting workers come in 40 per cent of the time. This report by The Canadian Press was first published April 21,2023. Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free) Sign In Register",
          "pubDate": "2023-04-21 21:04:08",
          "image_url": null,
          "source_id": "thestar",
          "category": [
            "business"
          ],
          "country": [
            "canada"
          ],
          "language": "english"
        },
        {
          "title": "New UAW leader already has issues with Detroit automakers",
          "link": "https://www.independent.co.uk/news/world/americas/ford-ap-general-motors-detroit-ohio-b2324586.html",
          "keywords": [
            "Americas",
            "World"
          ],
          "creator": [
            "Tom Krisher"
          ],
          "video_url": null,
          "description": "The new president of the United Auto Workers union isn't happy with Detroit's three automakers",
          "content": "To say that the new president of the United Auto Workers union is unhappy with Detroit 's three automakers would be an understatement. Shawn Fain, who took office in March after workers voted to sweep out most of the union's old leadership, listed grievances with Stellantis, General Motors and Ford in a wide-ranging talk Friday with reporters. The disputes surely will become part of national contract talks between the union and the auto companies that will begin this summer. Agreements with all three expire on Sept. 14, and bargaining is expected to be contentious. Speaking to the Automotive Press Association in Detroit, Fain said members are demanding that the union win back cost-of-living pay raises and pensions they lost, and the elimination of tiers of workers who are paid differently but do the same jobs. They also want assurances that good-paying union jobs will be preserved as the companies transition from gasoline-powered vehicles to those that run on electricity. Auto companies, he said, have made billions over the last decade but workers haven't gotten their fair share since the companies got into financial trouble in 2009. “I want to work with the companies. I want to have a good relationship,\" Fain said. \"But if they're not going to treat our members with respect and not give them their due, then we're going to have issues.” His biggest beef, though, seemed to be with Stellantis, which is moving to close a factory in Belvidere, Illinois. The company also failed to include the union when it announced a joint-venture electric vehicle battery factory in Kokomo, Indiana, Fain said. Asked if closing the Belvidere plant was a red line for the union that would provoke a strike, Fain said he didn't want to talk about the union's plans. “It's unacceptable what they've done there,” he said. “And I've been very clear with the corporation that we expect things there to change.” Stellantis placed the Belvidere plant on “idle” in February and laid off most of its roughly 1,350 workers. The company wouldn't comment on Friday. All three companies have announced plans to build multiple joint-venture battery factories in the U.S., and only GM thus far has recognized the union to bargain for workers, at a plant near Warren, Ohio . Fain said. GM has two more battery plants in the works in Tennessee and Michigan, and Ford is planning an assembly plant in Tennessee and three new battery plants in Kentucky and Tennessee. Fain said he understands the need to form ventures to get access to technology, but “they can't form joint ventures with the intents and purpose also of circumventing the commitment to our members and to agreements.” He said there's no reason the companies couldn't form a joint venture with the union so workers have a place to go when plants that make things for internal combustion vehicles close. Fain said he expects change to happen now with the battery plants, but the companies may want to wait for the contract talks. GM, he said, is offering $16.50 per hour with a top wage of $20 at the Ohio battery plant, even though it takes two years of training to do the jobs. Those wages, he said, would set members back 10 or 15 years. Production workers now make about $32 per hour. “That is a race to the bottom,” Fain said of GM's offer. “These should be higher wages than our production standards, not lower.” Ford and GM said in statements that they look forward to working with the union. Ultium Cells LLC, GM's battery joint venture, wouldn't comment on the bargaining but said it would work in good faith with the UAW to reach an agreement.",
          "pubDate": "2023-04-21 20:44:31",
          "image_url": "https://static.independent.co.uk/2023/04/21/21/Auto_Workers_Tough_Talk_83534.jpg?width=1200&auto=webp",
          "source_id": "independentuk",
          "category": [
            "world"
          ],
          "country": [
            "united kingdom"
          ],
          "language": "english"
        },
        {
          "title": "VIDEO: B.C. trades students compete in Skills Canada competitions in Abbotsford",
          "link": "https://www.vicnews.com/news/video-b-c-trades-students-compete-in-skills-canada-competitions-in-abbotsford/",
          "keywords": [
            "News",
            "Video",
            "Education",
            "skilled trades",
            "video"
          ],
          "creator": [
            "Jessica Peters"
          ],
          "video_url": null,
          "description": "Annual event brings hundreds of students together for competitions, hands-on learning and more",
          "content": "Students came from all over the province this week to compete in the annual Skills Canada provincials in Abbotsford. The event brings a wide range of tradespeople together at Tradex. While the event is mostly a competition for high school and post-secondary students, it’s also a chance for businesses, trades organizations, and training and education providers to connect with potential students and employees. It’s also a chance for students of all ages to try out different types of trades, with hands-on booths set up throughout the building. Younger students were able to compete in competitions that had them building things like spaghetti bridges or a wind turbine, or competing against each other with mini sumo robots. Competitions included several types of animation, aerospace technology, aesthetics, architectural and mechanical CAD, automation, automotive service, painting and collision repair, baking and culinary arts, cabinetmaking, carpentry, CNC machining, electronics and electrical wiring, fashion, graphic design, hair styling, heavy vehicle technology, mechanic millwright, landscaping, masonry, IT, mechatronics, photography, plumbing, robotics and more. @CHWKcommunity jessica.peters@abbynews.com Like us on Facebook and follow us on Twitter . Education skilled trades video The Provincial Skills Canada competition was held April 19 in Abbotsford at the Tradex. (Jessica Peters/Abbotsford News) The Provincial Skills Canada competition was held April 19 in Abbotsford at the Tradex. (Jessica Peters/Abbotsford News) The Provincial Skills Canada competition was held April 19 in Abbotsford at the Tradex. (Jessica Peters/Abbotsford News) The Provincial Skills Canada competition was held April 19 in Abbotsford at the Tradex. (Jessica Peters/Abbotsford News) The Provincial Skills Canada competition was held April 19 in Abbotsford at the Tradex. (Jessica Peters/Abbotsford News) The Provincial Skills Canada competition was held April 19 in Abbotsford at the Tradex. (Jessica Peters/Abbotsford News)",
          "pubDate": "2023-04-21 20:26:00",
          "image_url": "https://www.vicnews.com/wp-content/uploads/2023/04/32470936_web1_230419-ABB-SkillsCompetition-students_2.jpg",
          "source_id": "vicnews",
          "category": [
            "top"
          ],
          "country": [
            "canada"
          ],
          "language": "english"
        },
        {
          "title": "China sees more state-sector funds launched after policy drive",
          "link": "https://www.fijitimes.com/china-sees-more-state-sector-funds-launched-after-policy-drive/",
          "keywords": [
            "News",
            "World",
            "China sees more state-sector funds launched after policy drive",
            "Fiji Times World News",
            "Fiji World News",
            "Reuters World News",
            "Times World News",
            "World News",
            "World News Fiji Times"
          ],
          "creator": [
            "Reuters Reuters"
          ],
          "video_url": null,
          "description": "By Jason Xue and Summer Zhen SHANGHAI/HONG KONG (Reuters) – Chinese asset managers are rushing to launch funds to woo investors into state-owned firms, whose shares have surged this year as Beijing pushes the market to revalue the previously overlooked state sector. Shares of state-owned enterprises (SOEs) have risen sharply since November, when top securities […]",
          "content": "FILE PHOTO: A man stands near a screen showing news footage of Chinese President Xi Jinping at the China Securities Regulatory Commission (CSRC) building on the Financial Street in Beijing, China July 9, 2021. REUTERS/Tingshu Wang By Jason Xue and Summer Zhen SHANGHAI/HONG KONG (Reuters) – Chinese asset managers are rushing to launch funds to woo investors into state-owned firms, whose shares have surged this year as Beijing pushes the market to revalue the previously overlooked state sector. Shares of state-owned enterprises (SOEs) have risen sharply since November, when top securities regulator Yi Huiman called for a new model to price them. China’s state asset regulator has repeatedly urged SOEs to improve profitability and communications with investors, in line with Beijing’s overall efforts in the past three years to make these firms leaner and stronger. Mainland-listed state telecom operators China Mobile and China Telecom have jumped more than 50% each this year and China Petroleum & Chemical Corp has soared 44%, compared with a 5% gain in the benchmark index. The rally has spurred fund launches. More than 10 mutual fund companies have applied to launch nearly a score of SOE-dedicated funds since March, state media reported. E Fund Management Co this week launched a mutual fund, aiming to raise up to 8 billion yuan ($1.16 billion) to be ploughed into shares of strategically important SOEs. Rongtong Fund Management Co, which is controlled by an SOE tasked with managing state-owned capital, said it plans to roll out a series of products targeting SOEs. Pierre Hoebrechts, head of macro research at East Eagle Asset Management, points to the noticeable improvement in the finances of SOEs. “Generally, they have outperformed investors’ expectations. And many of them are much cheaper than their global peers, which is one of the factors that has made them an interesting segment to invest in over the past few months and going forward,” he said. State companies’ shares have so far outperformed the broader market, delivering what investors term a rare “SOE alpha”. The CSI State-owned Enterprises Composite Index is up 8% so far this year and the CSI Central-SOEs Technological Innovation Index has soared 24%. The funds are hoping to cash in on improving retail sentiment, focused on SOE reforms and technological self-reliance. Turnover in the A-share market has surpassed 1 trillion yuan ($145.26 billion) for two weeks. BETTER COMMUNICATION Qi Wang, CEO of MegaTrust Investment(HK) says SOEs have also improved investor communication and transparency, citing the example of a planned 20-minute conference call with a large SOE’s investor relations (IR) official that extended to more than an hour. “The company IR was eager to impress us and did most of the talking. This is a major departure from their unenthusiastic manner years ago,” Wang said in a note to clients. Investors also expect SOEs to play a big role in Beijing’s desire for tech self-sufficiency and national security in its rivalry with the United States. Yuan Yuwei, hedge fund manager at Water Wisdom Asset Management, said investors should consider treating Chinese telecom giants as growth, rather than value stocks, given their growth outlook in cloud computing. That means “there is a huge valuation upside potential,” said Yuan, who started buying Chinese telecom and oil companies last November. However, there are some questions in the market about whether the rally will be sustained. “In the long term, SOEs’ performance still needs more fundamental support,” said Lei Meng, China equities strategist at UBS Securities. “We need to observe the implementation of more policy details or more improvements in SOEs’ operating efficiency.” MegaTrust’s Wang also sees SOEs as good trading opportunities, not ideal for long-term investment. “We are still at the early stage of moving from mediocre to good, not from good to great … this is not yet a Cinderella story.” ($1 = 6.8850 Chinese yuan) (Reporting by Jason Xue and Samuel Shen in Shanghai, Summer Zhen in Hong Kong; Editing by Vidya Ranganathan & Shri Navaratnam)",
          "pubDate": "2023-04-21 20:05:41",
          "image_url": null,
          "source_id": "fijitimes",
          "category": [
            "sports"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "Primary goal of Chalmers’ ‘values-based capitalism’ is to make Labor look busy",
          "link": "https://www.skynews.com.au/insights-and-analysis/old-socialist-project-the-primary-goal-of-jim-chalmers-valuesbased-capitalism-is-to-make-labor-look-busy/news-story/23991e484272606a2d65ae6aa8b802aa",
          "keywords": [
            "Insights and analysis",
            "Economic Inclusion Advisory Committee",
            "Jim Chalmers",
            "labor",
            "Macklin Committee",
            "Nick Cater"
          ],
          "creator": [
            ""
          ],
          "video_url": null,
          "description": "No amount of vacuous, repetitive linguistic nonsense can disguise the real intention of the government’s economic inclusion strategy.",
          "content": "The Treasurer has barely 250 days to rebuild capitalism, the bold project for 2023 that he announced in January. This would be the year that Labor transformed the economy into “something better, more meaningful and inclusive… a new values-based capitalism for Australia”, Jim Chalmers wrote in an essay he now possibly regrets. This week Chalmers learned how expensive values-based capitalism will be thanks to a report from the Economic Inclusion Advisory Committee, a review body headed by former Labor minister Jenny Macklin he established shortly before Christmas. The committee makes 37 recommendations, every one of them beginning with two dispiriting words: “The Government”. The two most expensive proposals, lifting unemployment benefits and increasing rental subsidies, have reportedly been rejected by Chalmers - who can ill-afford another $34 billion in a Budget that is already some $50 billion in the red. Having convinced most commentators that this is merely a “structural deficit”, rather than an actual liability to taxpayers, he wouldn’t want to push his luck. Economic inclusion is the new name for an old socialist project, the levelling of inequalities through technocratic means. The fear that unchecked economic freedom widens the gap between rich and poor troubles their souls. Yet Australia’s experience suggests the opposite: governments that give people the freedom to flourish, champion middle-class aspirations and foster the entrepreneurial spirit tend to preside over growing economies. Those that constrain the choices their citizens make through tax and regulation make every household poorer, except those whose incomes aren’t paid by the government. While Chalmers and Macklin are not entirely opposed to growth, they insist that it must be inclusive. This means redistributing other people’s money until they run out of things to tax, which is pretty much where Labor finds itself right now. Economic inclusion is not only devilishly expensive, it is diabolically complicated, as the Macklin Committee’s report demonstrates. Lifting the dole by 40 per cent is all very well, but you’ve somehow got to persuade recipients to keep looking for work. While we should expect the government to help those who are down on their luck, unemployment should never be a lifestyle choice. The incentive to find employment declines in inverse proportion to the generosity of the welfare cheque, as we discovered during the COVID emergency. Many of Macklin’s recommendations call for new or improved government programmes to overcome this human trait. They appear to be not dissimilar to programmes that have failed in the past. They are couched in the dreary mumbo jumbo of technocracy which means that many of the recommendations are impossible for ordinary mortals to understand, let alone evaluate. What would the “whole-of-government strategic learning framework” look like for example? How would it serve “to coordinate evidence, evaluation, learning, innovation and adaptive decision-making” as described in recommendation 29? What makes it different from the “whole-of-government policy and investment framework for place-based initiatives” in recommendation 17? More importantly what will it cost, since recommendation 18 is that it should be fully funded? What’s the difference between “a full employment objective” (recommendations five, six and seven) and the long-held, bipartisan assumption that the best form of welfare is a job? The Macklin Committee recommends that these and other responsibilities be handed to the Treasurer, who should be given portfolio responsibility for Economic Inclusion and Poverty Reduction. He would be tasked with developing a “data, evidence and consultation strategy” (recommendation 35) that would underpin “a multidimensional poverty index” (recommendation 36). It is quickly apparent that no amount of vacuous, repetitive linguistic nonsense can disguise the real intention of the government’s economic inclusion strategy. It is designed to make a Labor government look busy. The fight against economic exclusion is a massive make-work scheme for bureaucrats, government agencies and the mysterious people known as stakeholders who feature in recommendations 21 and 25. None of this should come as a surprise since the first beneficiaries of every government programme are the people paid to administer it. It is doubtful that the committee’s proposals will do anything for the economically excluded themselves, since the track record of centrally planned programmes designed to fix human problems is extremely poor. The uneven performance of these technocratic schemes has been a source of enormous frustration for would-be improvers of society. They constantly struggle with the paradox of the moon and the ghetto highlighted by the American political scientist Richard Nelson in a much-cited 1977 essay. “If we can land a man on the moon,” writes Nelson, “why can't we solve the problems of the ghetto?” In a country like the US with its vast resources and powerful technologies, why can’t medical care be delivered at reasonable cost to all who need it, why can’t socially and economically disadvantaged children be better educated or the rise in housing and services costs be halted? Prime ministers appoint ministers to improve the lives of the disadvantaged in the least-worst way a government can. The job of the ministers for welfare, health and education is to call bureaucrats to account, to ensure that government programmes do what they’re designed to do effectively and efficiently. Crowning Chalmers as the economic inclusion and anti-poverty tsar is a distraction he could do without as a treasurer who is struggling to do his day job of balancing the budget and fostering a climate of economic growth. The Macklin committee’s report meanwhile should be left to bury itself beneath a mountain of dust.",
          "pubDate": "2023-04-21 20:00:00",
          "image_url": null,
          "source_id": "skynewsau",
          "category": [
            "top"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        }
      ],
    "world": [
        {
          "title": "Healthcare delivery ‘in serious trouble’",
          "link": "https://www.fijitimes.com/healthcare-delivery-in-serious-trouble/",
          "keywords": [
            "Local News",
            "News",
            "Politics",
            "Fiji News",
            "Healthcare delivery 'in serious trouble'",
            "Retired and long-serving specialist surgeon Dr Eddie McCaig",
            "Times News"
          ],
          "creator": [
            "Shayal Devi"
          ],
          "video_url": null,
          "description": "One of Fiji’s leading orthopedic surgeons says healthcare delivery in the country is “in serious trouble”. Dr Eddie McCaig said the issues were obvious while speaking at the National Economic Summit (NES) third plenary session on Thursday which focused on universal coverage and basic health care. “It doesn’t take a specialist to tell us that, […]",
          "content": "Health officials help carry a patient from an ambulance outside the CWM Hospital in Suva. Dr Eddie McCaig says healthcare delivery in the country is \"in serious trouble\". Picture: JOVESA NAISUA/FILE One of Fiji’s leading orthopedic surgeons says healthcare delivery in the country is “in serious trouble”. Dr Eddie McCaig said the issues were obvious while speaking at the National Economic Summit (NES) third plenary session on Thursday which focused on universal coverage and basic health care. “It doesn’t take a specialist to tell us that, we see it in the papers and we see it from our relatives each day,” he said. “The way we treat patients has dramatically changed over the last few years, again because of socio-economic considerations. “We do not have the resources to provide all the care that is promoted by providers and desired and demanded by the public, who increasingly with travel, tourism and relatives abroad, have an unrealistic expectation of our system. “They all expect a Shortland Street type of hospital.” Dr McCaig said no public health system in the world today could adequately look after its citizens as the cost was too much. However, he acknowledged that the public sector had always received help from the private sector — whether it be through good Samaritans, donors or free medical services provided by overseas experts like those from Shriners Hospital and Sai Prema Foundation among others. In addition, Dr McCaig said visiting surgical teams from overseas also carried out procedures such as shoulder, hand, plastic, cardiac and knee surgeries. “With the failing infrastructure, we’ve all seen the photos of CWM, Savusavu and Levuka hospitals. “We also have to thank the public, people who got into their shorts and shirts etcetera and have cleaned up CWM and Levuka and continued to clean up Savusavu.”",
          "pubDate": "2023-04-21 23:30:59",
          "image_url": null,
          "source_id": "fijitimes",
          "category": [
            "top"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "Hunter Biden is a ‘deviant personality’",
          "link": "https://www.skynews.com.au/world-news/united-states/hunter-biden-is-a-deviant-personality/video/9858c6feed0c6f83f30bff2747553928",
          "keywords": [
            "United states",
            "World"
          ],
          "creator": [
            ""
          ],
          "video_url": null,
          "description": "Former advisor to John Howard, Peter McGauran, says that many Americans perceive a double standard in the US court system regarding the treatment of Republicans and Democrats, citing Hunter Biden as an example of a \"deviant personality.\" \"He's on Air Force One going to Ireland with the President, bold as brass,\" Mr McGauran told Sky News Australia. \"So Americans see a double standard, and that's why many of them will support Trump, at least temporarily.\"",
          "content": "Former advisor to John Howard, Peter McGauran, says that many Americans perceive a double standard in the US court system regarding the treatment of Republicans and Democrats, citing Hunter Biden as an example of a “deviant personality.” “He’s on Air Force One going to Ireland with the President, bold as brass,” Mr McGauran told Sky News Australia. “So Americans see a double standard, and that’s why many of them will support Trump, at least temporarily.”",
          "pubDate": "2023-04-21 23:17:22",
          "image_url": null,
          "source_id": "skynewsau",
          "category": [
            "world"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "Activists mark Earth Day as scientists warn of more extreme weather",
          "link": "https://www.fijitimes.com/activists-mark-earth-day-as-scientists-warn-of-more-extreme-weather/",
          "keywords": [
            "News",
            "World",
            "Activists mark Earth Day as scientists warn of more extreme weather",
            "Fiji Times World News",
            "Fiji World News",
            "Reuters World News",
            "Times World News",
            "World News",
            "World News Fiji Times"
          ],
          "creator": [
            "Reuters Reuters"
          ],
          "video_url": null,
          "description": "By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, […]",
          "content": "FILE PHOTO: A general view shows almost dried up Lake Zicksee near Sankt Andrae, as another heatwave is predicted for parts of the country, in Austria, August 12, 2022. REUTERS/Leonhard Foeger/ By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, officially marked on Saturday, has included a week of conservation and clean-up activities around the world, and festivals were due to begin in Rome and Boston on Friday. Thousands were expected to gather in London on Friday to begin four days of events known as the “Big One”, organised by the Extinction Rebellion activist group. A rally was to be staged in Washington urging President Joe Biden to commit to ending fossil fuel use. On Saturday, volunteers will also begin major clean-up campaigns at Lake Dal in India’s Srinigar and Florida’s hurricane-hit Cape Coral. On Thursday, Biden pledged to increase U.S. funding to help developing countries fight climate change and curb deforestation in Brazil’s Amazon rainforest during a meeting with leaders from the world’s largest economies. U.N. Secretary General Antonio Guterres told countries attending Biden’s Major Economies Forum that “a quantum leap in climate action” was required to limit temperature rises to 1.5 degrees Celsius. He warned in a recorded Earth Day message that “we seem hellbent on destruction”. Earth Day this year follows weeks of extreme weather with temperatures hitting a record 45.4 degrees Celsius (113.7 Fahrenheit) in Thailand and another punishing heatwave in India, where at least 13 people died of heatstroke at a ceremony last weekend. Scientists warned this week that killer heatwaves were putting “unprecedented burdens” on India’s agriculture, economy and public health, and undermining the country’s long-term efforts to reduce poverty, inequality and illness. Average global temperatures could hit record highs this year or in 2024, driven by climate change and the anticipated return of the “El Nino” weather phenomenon, climate scientists said on Thursday. (Reporting by David Stanway; Editing by William Mallard)",
          "pubDate": "2023-04-21 23:03:28",
          "image_url": null,
          "source_id": "fijitimes",
          "category": [
            "top"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "White House race intensifies as Biden prepares to announce re-election bid",
          "link": "https://www.skynews.com.au/world-news/united-states/white-house-race-intensifies-as-biden-prepares-to-announce-reelection-bid/video/352f69d5ba17e17303b964991262d104",
          "keywords": [
            "United states",
            "World",
            "fb",
            "msn",
            "usa",
            "world",
            "yt"
          ],
          "creator": [
            ""
          ],
          "video_url": null,
          "description": "The race for the White House is about to heat up, as US President Joe Biden is expected to announce his re-election bid next week. The Republicans watch with keen interest as they determine who will run on their party's behalf.",
          "content": "The race for the White House is about to heat up, as US President Joe Biden is expected to announce his re-election bid next week. The Republicans watch with keen interest as they determine who will run on their party’s behalf.",
          "pubDate": "2023-04-21 23:01:59",
          "image_url": null,
          "source_id": "skynewsau",
          "category": [
            "world"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "5 of the best budget-friendly tropical holiday destinations",
          "link": "https://www.yorkpress.co.uk/news/national/uk-today/23463172.5-best-budget-friendly-tropical-holiday-destinations/?ref=rss",
          "keywords": null,
          "creator": null,
          "video_url": null,
          "description": "Want to take a break without breaking the bank account? Discover the best tropical destinations that are budget-friendly.",
          "content": "Taking a holiday in the sunshine, surrounded by miles of golden sand and blue seas’ sounds like a dream to many of us. But tropical breaks aren’t always cheap with many dream destinations coming with a price tag upwards of £10,000. However, away from the Maldives and Bora Bora, there are plenty more affordable options that offer you everything and more. So, you don’t have to hunt them down and look for the best deals, we’ve rounded up the five best affordable tropical destinations. The 5 best budget-friendly tropical holiday destinations Gili Islands Just a short boat ride away from Bali, Gili Islands offers a wealth of tropical living for just a quarter of the price. Set across three small islands with white sandy beaches, palm trees and impressive views of the Mt Rinjani volcano. Resorts in the area typically cost £40 per night and with food at just around £8 for two people the holiday could cost you less than £1,000. Cayo Largo del Sur Noted as having some of the best beaches in the world, Cayo Largo del Sur in Cuba has white beaches and has been described as very similar to the Maldives. Flights to Cuba typically cost around £400 but resort stays and food costs are cheap, making the trip average below £1,500. Mauritius Popular among many tropical holiday fans, Mauritius is a small island in the Indian Ocean that offers breathtaking scenery. On average, resorts cost around £140 a night with meals costing around £27 for two and flights take just over 16 hours. Koh Lipe This Thailand destination is the southernmost island in Thailand and has endless white sandy beaches and vibrantly blue water. Thailand has plenty of great deals with resorts costing less than £100 a night and food is a great price across the region too. Curacao Known as one of the Caribbean’s best-kept secrets, Curacao is filled with gorgeous beaches along its Western coast and has endless spots to watch magnificent sunsets. Resort stays cost around £100 a night with a beer at £1.50, but travel to the island can take longer than most with an average time of around 1 day. Use discount code ‘NQ15’ to get 15%ǂ off travel insurance ǂ Discount applies to base premium only. Terms & conditions apply.",
          "pubDate": "2023-04-21 23:01:00",
          "image_url": "https://www.yorkpress.co.uk/resources/images/16681492/?type=app&htype=0",
          "source_id": "yorkpress",
          "category": [
            "top"
          ],
          "country": [
            "united kingdom"
          ],
          "language": "english"
        },
        {
          "title": "‘Serious player’: Donald Trump returns to Instagram",
          "link": "https://www.skynews.com.au/world-news/united-states/serious-player-donald-trump-returns-to-instagram/video/787acea3c6e449f5fdfaf5d695cd0a4f",
          "keywords": [
            "United states",
            "World"
          ],
          "creator": [
            ""
          ],
          "video_url": null,
          "description": "Former US President Donald Trump's recent return to Instagram has made him a \"serious player\" in the United States again, according to Peter McGauran, a former advisor to John Howard. McGauran's comments come amid a surge of support for Trump from Americans following his recent appearance in court. “Because of the treatment of the courts about him,” Mr McGauran told Sky News Australia. “There’s always an enquiry, there’s always a prosecution against Trump – and nothing against any of the Democrat figures.”",
          "content": "Former US President Donald Trump’s recent return to Instagram has made him a “serious player” in the United States again, according to Peter McGauran, a former advisor to John Howard. McGauran’s comments come amid a surge of support for Trump from Americans following his recent appearance in court. “Because of the treatment of the courts about him,” Mr McGauran told Sky News Australia. “There’s always an enquiry, there’s always a prosecution against Trump – and nothing against any of the Democrat figures.”",
          "pubDate": "2023-04-21 22:59:05",
          "image_url": null,
          "source_id": "skynewsau",
          "category": [
            "world"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "Russia accidentally bombs its own city",
          "link": "https://www.skynews.com.au/world-news/global-affairs/russia-accidentally-bombs-its-own-city/video/e8f3f5077c4235ce01ada51bede85a90",
          "keywords": [
            "Global Affairs",
            "World"
          ],
          "creator": [
            ""
          ],
          "video_url": null,
          "description": "Moscow has admitted responsibility for the accidental bombing by the Russian air force of a residential area on the outskirts of its own city, which borders Ukraine. The incident comes as Ukraine prepares for a major counteroffensive against Russian forces.",
          "content": "Moscow has admitted responsibility for the accidental bombing by the Russian air force of a residential area on the outskirts of its own city, which borders Ukraine. The incident comes as Ukraine prepares for a major counteroffensive against Russian forces.",
          "pubDate": "2023-04-21 22:57:01",
          "image_url": null,
          "source_id": "skynewsau",
          "category": [
            "world"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "Caitlyn Jenner mourns death of mum Esther Jenner",
          "link": "https://7news.com.au/entertainment/celebrity/caitlyn-jenner-mourns-death-of-mum-esther-jenner-c-10421731",
          "keywords": null,
          "creator": [
            "Gabrielle Chung"
          ],
          "video_url": null,
          "description": "‘She is the only person that loved me my entire life.’",
          "content": "Caitlyn Jenner’s family has lost their beloved matriarch The Olympian’s mum, Esther Jenner, died on April 20 at the age of 96. “I am heartbroken to announce my mom passed away yesterday morning, peacefully,” Caitlyn wrote on Instagram. “Losing a mother is unique in the sense that she is the only person that loved me my entire life.” Stream the world's best reality, entertainment and true crime shows for free on 7Bravo on Esther’s death came “a few weeks shy” of her 97th birthday, Caitlyn shared. “I will miss her tremendously,” the 73-year-old added in her tribute. “Love you mom.” Fans were first introduced to Esther when Caitlyn appeared alongside ex Kris Jenner and their kids on Keeping Up With the Kardashians, appearing at various family functions. She went on to become a notable fixture on I Am Cait, the E! docu-series centred around Caitlyn’s journey as a transgender woman. “It seems as though when people start to have more understanding, the stigma of being different goes away,” Esther said on one episode of the show. “To me, that’s the beauty of [Caitlyn] giving herself permission to do this because—like for any of us—once you’ve seen something over and over again, you get more used to it, right?” Esther also joined Caitlyn as her special plus-one at the 2015 ESPYs, where the gold medal-winning decathlete was honoured with the Arthur Ashe Courage Award. During her acceptance speech, Caitlyn credited her mother for being her source of strength. “I always thought that I got my courage and my determination from my dad who landed on Omaha beach and fought all the way through World War II,” Caitlyn said at the time. “I’m realising now, mom: I think I got all of those qualities from you.” Esther is survived by friends and family, including granddaughters Kendall Jenner and Kylie Jenner.",
          "pubDate": "2023-04-21 22:54:12",
          "image_url": "https://images.7news.com.au/publication/C-10421731/7f878bfb0746fa5694765827413e8dbcb0fc307c-16x9-x0y0w2000h1125.png",
          "source_id": "7news",
          "category": [
            "entertainment"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "TEN FAMILY MEMBERS GUNNED DOWN IN SA",
          "link": "http://www.newsdzezimbabwe.co.uk/2023/04/ten-family-members-gunned-down-in-sa.html",
          "keywords": [
            "NEWS"
          ],
          "creator": null,
          "video_url": null,
          "description": null,
          "content": "Seven females and three males were killed when their home near the city of Pietermaritzburg was ambushed early on Friday morning. Police Minister Bheki Cele said two suspects had been arrested, one was shot dead and another is still at large. The motive is unclear. South Africa has one of the world's highest murder rates. Police were first alerted to the shooting after neighbours heard gunshots. Mr Cele said one of the victims was as young as 13, adding: \"It's a crime scene, terrible. Too many people were lost here.\" \"They have arrested two people, one was injured, one is dead, one ran away and three firearms were recovered,\" he told reporters at the scene of the shooting in the township of Imbali in eastern KwaZulu-Natal province. One child has reportedly been taken to hospital. According to local media, the gunmen managed to gain entry to the property after posing as police officers. Mr Cele confirmed they had located the suspects at the house of a witch doctor - a traditional healer - where they had sought refuge. Police said one of the suspects - the man who was shot dead - had been on their wanted list for a long time. This part of South Africa is known for featuring regularly in national crime stats for murder rates - a problem that has plagued it for a long time. It's the second mass shooting in KwaZulu-Natal province this week after four people were shot and killed on Thursday at another home north of the port city of Durban. In January, eight people were shot dead at a birthday party in Gqeberha city in Eastern Cape Province. It followed a string of gun attacks in bars last year, with at least 15 killed in one shooting alone. BBC",
          "pubDate": "2023-04-21 22:42:00",
          "image_url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjtG2YaMQcuNConuZlhapRzMy-3H9uhM9NM30l7ZD2VJ8zyugrsMNcXnsvJ5iE5mnqIjOq5FyNQRIe0TjLet8Zqy94DvquqP3vkKYu5lx7iaOw_x9DIDRrovKCLEextz7680UVCjzsXrrUtztoSoOu_YDMoRh8xauE6GoP_kDmjqIYz9EA1UH1z7Q/s72-w400-h225-c/TEN.webp",
          "source_id": "newsdzezimbabwe",
          "category": [
            "top"
          ],
          "country": [
            "Zimbabwe"
          ],
          "language": "english"
        },
        {
          "title": "Nedbank give netball double boost",
          "link": "https://www.herald.co.zw/nedbank-give-netball-double-boost/",
          "keywords": [
            "Sport"
          ],
          "creator": [
            "aurora"
          ],
          "video_url": null,
          "description": "Ellina Mhlanga-Senior Sports Reporter THE Zimbabwe senior netball team received a boost for their Netball World Cup preparations after Nedbank Zimbabwe unveiled a US$50 000 sponsorship. The signing ceremony for the partnership between the Zimbabwe Netball Association and Nedbank was held yesterday at Stodart Netball Complex. The financial services company are the main sponsor for […]",
          "content": "Ellina Mhlanga–Senior Sports Reporter HEAD coach for junior and youth teams Briad Nhubu says they are hoping to make the best of their week-long camp to ensure athletes are ready for the African Under-18 and Under-20 combined championships. The continental meet is set for Ndola, Zambia from April 29 to May 3. Zimbabwe are fielding […] Eddie Chikamhi-Senior Sports Reporter ZIMBABWE Rugby Union president Aaron Jani says the late national team captain Iain Forsyth Buchanan left an enduring legacy for domestic rugby with a career spanning over 100 games and captaining the Sables a record 53 times. The former Sables scrumhalf died this week at the age of 74 years. A […] Tadious Manyepo-Sports Reporter CHARLES Chiutsa is flying high. Reaching for the stars. He is certainly the most notable name in this Monomotapa team who are in their second year in the Premiership in 2006. The year earlier, Chiutsa made his debut in the top-flight. And he stood toe to toe with established players like the […]",
          "pubDate": "2023-04-21 22:02:07",
          "image_url": null,
          "source_id": "herald_zw",
          "category": [
            "sports"
          ],
          "country": [
            "Zimbabwe"
          ],
          "language": "english"
        }
      ]
}