{
  "date": {
    "now": "23/04/2023"
  },
  "economy": [
      {
          "title": "‘Consumer’ recession forecast for 2023 following Australia’s ‘weakest’ rate of economic growth",
          "link": "https://7news.com.au/business/economy/consumer-recession-forecast-for-2023-following-australias-weakest-rate-of-economic-growth-c-10411447",
          "keywords": null,
          "creator": [
            "Bianca Bongato"
          ],
          "video_url": null,
          "description": "Australians are being warned of a financial ‘knife-edge’. Here’s what it means for you.",
          "content": "Australians are being warned the country’s is on a “knife-edge“ after the Reserve Bank of Australia’s string of interest rate hikes, with a “consumer recession” predicted for 2023. The bleak news comes as Australia faces the “weakest” rate of economic growth outside the COVID pandemic since the recession in the early 1990s, according to a Deloitte Access Economics Business Outlook published this week. In its March 2023 report, it said the RBA is “tempting fate” after the bank announced two interest rate hikes earlier this year, totalling 10 consecutive hikes since May 2022. Looking for a new job or job candidate? Post jobs and search for local talent on The central bank did hit pause on hikes in the April decision - but is expected to press ahead with further hikes going forward. Deloitte Access Economics Partner and report lead author Stephen Smith said the economic circumstances have prompted a downgrade in Australia’s growth. “Our view remains unchanged – the additional 50 basis points of increases earlier this year were unnecessary, and have prompted a further downgrade in Australia’s growth outlook,” Smith said. “That downgrade is centred on our households, and a ‘consumer recession’ is now forecast in 2023, with household spending expected to finish the year below where it started.” While most Australians will pull through the difficult economic challenges, Smith says that many will not, especially mortgage holders. “At a cash rate of 3.6 per cent, most Australians will be just fine. Many, however, will not,” he added. “In just 10 months, the cost of servicing an average $600,000 mortgage will have risen by more than $14,000 per year once those rate hikes are fully passed through. “But that’s just the average, and there are plenty of mortgage holders on either side of those numbers.” That equates to a touch over $1166 per month. In the RBA’s latest Financial Stability Review, the bank suggested about 15 per cent of variable-rate, owner-occupier mortgage holders could be in a “negative cash flow” by the end of 2023, with many borrowers are already projected to be in this position. “On these numbers, at least 300,000 Australian households may currently be experiencing negative cash flow, with mortgage repayments and essential living expenses together exceeding household disposable income,” Smith said. “That should shock all of us.” A rental crisis is also plaguing the country, with a “solid” acceleration in rental growth experienced across Australian states, particularly in Sydney and Melbourne, according to a Domain March 2023 Rental Report. House rents have surged by $135 a week (or 31.4 per cent), while unit rents have increased by $140 (or 34.1 per cent) since the pandemic low, Domain said. “This is an issue of supply and demand, but private dwelling investment is forecast to fall rather than increase through 2023, before recovering only modestly in 2024,” Smith added. “Construction is expected to commence on significantly fewer houses and apartments compared to previous years – in fact, Deloitte Access Economics expects that 2023 will see construction commence on the fewest dwellings in more than a decade and almost 70,000 below the level commencements recorded in 2021.” For Smith, this means that housing supply would “just barely” be able to keep up with the demand in Australia. “On these numbers, new housing supply would just barely keep pace with population growth, let alone ease what is a critical undersupply,” he said. “In short, we are building far too few dwellings and, with a myriad of supply side challenges unresolved, that is unlikely to change in the near term.” Combined issues of a cost of living crisis, a slowdown in dwelling construction, and an unpredictable economic global environment, Deloitte Access Economics revised down expectations for Australian economic growth in 2023 and 2024 to 1.5 per cent and 1.2 per cent respectively. While some industries may survive in this new environment, others will struggle, according to Smith. “Some sectors of the economy are better positioned to face the slowdown than others, with retail and construction forecast to feel the pinch, while agriculture may pull back after recent highs,” he said. But the results vary across Australian states, with the “consumer-led slowdown” set to impact NSW and Victoria the most. “While the consumer-led slowdown will hit hardest in New South Wales and Victoria, conditions are softening in most other jurisdictions as well,” Smith said. “Western Australia and Queensland are still relative bright spots, with mineral exports adding to the growth outlook.”",
          "pubDate": "2023-04-21 23:25:41",
          "image_url": "https://images.7news.com.au/publication/C-10411447/8ff37912464516e10266756f04c94c207f28cb3a-16x9-x0y110w2121h1193.jpg",
          "source_id": "7news",
          "category": [
            "business"
          ],
          "country": [
            "australia"
          ],
          "language": "english"
        },
        {
          "title": "Activists mark Earth Day as scientists warn of more extreme weather",
          "link": "https://www.fijitimes.com/activists-mark-earth-day-as-scientists-warn-of-more-extreme-weather/",
          "keywords": [
            "News",
            "World",
            "Activists mark Earth Day as scientists warn of more extreme weather",
            "Fiji Times World News",
            "Fiji World News",
            "Reuters World News",
            "Times World News",
            "World News",
            "World News Fiji Times"
          ],
          "creator": [
            "Reuters Reuters"
          ],
          "video_url": null,
          "description": "By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, […]",
          "content": "FILE PHOTO: A general view shows almost dried up Lake Zicksee near Sankt Andrae, as another heatwave is predicted for parts of the country, in Austria, August 12, 2022. REUTERS/Leonhard Foeger/ By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, officially marked on Saturday, has included a week of conservation and clean-up activities around the world, and festivals were due to begin in Rome and Boston on Friday. Thousands were expected to gather in London on Friday to begin four days of events known as the “Big One”, organised by the Extinction Rebellion activist group. A rally was to be staged in Washington urging President Joe Biden to commit to ending fossil fuel use. On Saturday, volunteers will also begin major clean-up campaigns at Lake Dal in India’s Srinigar and Florida’s hurricane-hit Cape Coral. On Thursday, Biden pledged to increase U.S. funding to help developing countries fight climate change and curb deforestation in Brazil’s Amazon rainforest during a meeting with leaders from the world’s largest economies. U.N. Secretary General Antonio Guterres told countries attending Biden’s Major Economies Forum that “a quantum leap in climate action” was required to limit temperature rises to 1.5 degrees Celsius. He warned in a recorded Earth Day message that “we seem hellbent on destruction”. Earth Day this year follows weeks of extreme weather with temperatures hitting a record 45.4 degrees Celsius (113.7 Fahrenheit) in Thailand and another punishing heatwave in India, where at least 13 people died of heatstroke at a ceremony last weekend. Scientists warned this week that killer heatwaves were putting “unprecedented burdens” on India’s agriculture, economy and public health, and undermining the country’s long-term efforts to reduce poverty, inequality and illness. Average global temperatures could hit record highs this year or in 2024, driven by climate change and the anticipated return of the “El Nino” weather phenomenon, climate scientists said on Thursday. (Reporting by David Stanway; Editing by William Mallard)",
          "pubDate": "2023-04-21 23:03:28",
          "image_url": null,
          "source_id": "fijitimes",
          "category": [
            "top"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "NES: 14 key resolutions reached",
          "link": "https://www.fijitimes.com/nes-14-key-resolutions-reached/",
          "keywords": [
            "Local News",
            "News",
            "Politics",
            "Fiji News",
            "Minister for Finance Professor Biman Prasad",
            "National Economic Summit (NES)",
            "NES: 14 key resolutions reached",
            "Times News"
          ],
          "creator": [
            "Shayal Devi"
          ],
          "video_url": null,
          "description": "As 14 key resolutions were reached upon the conclusion of the two-day National Economic Summit (NES) yesterday, Minister for Finance Professor Biman Prasad hailed the wide cross-section of stakeholders who participated at the event. The resolutions were reached after thorough deliberations carried out through five plenary sessions and 12 thematic working groups. Prof Prasad also […]",
          "content": "Deputy Prime Minister and Minister for Finance Biman Prasad in an interview at the National Economic Summit iin Suva, on Thurs 20 April 2023. Picture: ELIKI NUKUTABU As 14 key resolutions were reached upon the conclusion of the two-day National Economic Summit (NES) yesterday, Minister for Finance Professor Biman Prasad hailed the wide cross-section of stakeholders who participated at the event. The resolutions were reached after thorough deliberations carried out through five plenary sessions and 12 thematic working groups. Prof Prasad also highlighted that the Fiscal Review Committee chair had highlighted the “triple threat” facing the Fiji economy. These are: excessively high Government debt, delayed investment in critical infrastructure and the impact of unforeseen shocks from climate change and other global and local risks. “It has been heartening to see the level of engagement and the willingness of our participants to consider the pressing issues facing our economy,” he said. Prof Prasad reiterated that economic growth was the key – and that the summit was the first step in a united, people-driven approach to achieving a better economic future for all. The resolutions include: • Government’s economic strategy to focus on trusted leadership and good governance, climate change and environmental sustainability and improving the climate for investment. • Sound fiscal discipline in Government in both revenue raising and expenditure to address critical operational and investment needs, while bringing Government debt down. • Better accountability from the legislative, executive and judicial arms of Government to build economic confidence. • Upgrade and prioritise work on human development, in areas of health, education, housing, youth, women and girls and abuse of children, poverty alleviation. • Unleash the potential of rural and outer island areas by infrastructure upgrade and resource provision. • Reform outdated laws involving agriculture. • Need coordinated conservation and better regulation of fisheries to develop marine-based activities. • Upgrade technology based education at all levels. • Increase engagement and empowerment of Fiji’s indigenous population in commerce and business. • Immediately prioritise the upgrade and maintenance of Fiji’s water, sewerage supply and waste management systems in urban centres throughout Fiji, with particular attention to the Suva-Nausori corridor. • Recognise efficient and eco-friendly land, marine and transportation systems critical to Fiji’s sustainable development. • Need for greater electricity capacity and connectivity, focus on renewable and climate resilient energy sources. • Reinvigorate institutional and planning machinery of each ministry and its coordination and linkage to the national strategic development policy. • Continue the 12 thematic working groups as a basis of continued consultation and dialogue.",
          "pubDate": "2023-04-21 22:15:22",
          "image_url": null,
          "source_id": "fijitimes",
          "category": [
            "sports"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "'Workers demand better': Provincial unions rally ahead of election, stand in solidarity with PSAC pickets",
          "link": "https://calgaryherald.com/news/local-news/provincial-unions-rally-in-support-of-psac-pickets",
          "keywords": [
            "Local News",
            "News"
          ],
          "creator": [
            "Stephanie Babych"
          ],
          "video_url": null,
          "description": null,
          "content": "Workers from a number of labour groups waved their union’s flags and marched in downtown Calgary on Friday afternoon to demand better from the provincial government and stand in solidarity with federal pickets. The rally, led by the Alberta Federation of Labour (AFL), saw hundreds of workers walk from the TELUS Convention Centre to city hall, where representatives from the unions spoke above chants of “workers deserve better,” and “solidarity.” The speakers called for better wages, Canada Pension Plan (CPP) protection and greater support in the face of severe staff shortages. “Employers in this province and the private sector are making record profits. Our provincial government’s coffers are full. Our economy is strong and its prospects for the future are bright. In this context, Alberta workers do not have to lower their expectations,” AFL president Gil McGowan shouted to the crowd. “You do not have to settle for less.” The rally comes just a few weeks before Albertans head to the ballot box. Talk of the approaching provincial election prompted chants of “NDP” from the crowd outside city hall. Gavin McGarrigle, western regional director with Unifor, said representatives from Unifor were proud to stand in solidarity with AFL members. “We’re going to do this the way we have to do it: boots on the ground, every day, every week for the next four weeks. That’s the fastest way to get us all better contracts, is to get rid of this government and get a government by workers and for workers to make sure we make this province better,” McGarrigle said to cheers from the crowd. McGowan said the rally should send a strong message to employers in Alberta’s public and private sectors. Workers in the province should not have to put up with disrespect in the workplace, he said. “Workers demand better,” McGowan said. “For the last year and a half, we’ve been living through a period of unprecedented inflation. The cost of living is way up and wages have not kept up.” Rory Gill, president of the Canadian Union of Public Employees (CUPE) Alberta division, said the labour movement has been revitalized. “There’s a moment in Canada right now, not just in Alberta, where workers are saying, we want better. We want better schools, we want better governance and we want better social services,” said Gill. Asked about the upcoming provincial election, Gill said the NDP has made it clear that their priorities are working people and the problems that everyday working people are facing. “We believe that an NDP government is a government that we as the labour movement can work with,” said Gill. Following the rally at city hall, the workers marched to the Harry Hays Building to join the Public Service Alliance of Canada (PSAC) picket line. PSAC announced a strike Wednesday after failing to reach an agreement with the federal government the day before. The Health Sciences Association of Alberta (HSAA) has said . According to the union, which represents the health-care workers employed by DynaLife, they are looking to get back to the bargaining table after informal mediation was unsuccessful. The impasse could lead to job action. “We’re seeing active privatization of our health care through our EMS, long-term care and our lab services. It is shameful and we must stand our ground. This battle begins now. We fight today, we fight every day. Enough is enough,” Mike Parker, president of the HSAA, said at Friday’s rally. Also represented at the rally were United Food & Commercial Workers Local 401, United Nurses of Alberta, PSAC and the Amalgamated Transit Union Local 583.",
          "pubDate": "2023-04-21 21:49:31",
          "image_url": null,
          "source_id": "calgaryherald",
          "category": [
            "politics",
            "world"
          ],
          "country": [
            "canada"
          ],
          "language": "english"
        },
        {
          "title": "Govt to mitigate rising costs for low income earners",
          "link": "https://fijilive.com/govt-to-mitigate-rising-costs-for-low-income-earners/",
          "keywords": [
            "Featured",
            "News",
            "Ministry of Education",
            "National Economic Summit",
            "Professor Biman Prasad"
          ],
          "creator": [
            "Ilaitia Ravuwai"
          ],
          "video_url": null,
          "description": "Deputy Prime Minister Prof Biman Prasad has noted an urgent demand from the people for solutions to their daily challenges, including the rising cost of living. Speaking to the media after National Economic Summit Communiqué was issued; Prof Prasad says they will pursue the most sustainable solution to improving cost of living challenges that must […]",
          "content": "Deputy Prime Minister Prof Biman Prasad has noted an urgent demand from the people for solutions to their daily challenges, including the rising cost of living. Speaking to the media after National Economic Summit Communiqué was issued; Prof Prasad says they will pursue the most sustainable solution to improving cost of living challenges that must come from rising incomes sourced through economic growth. In the short term, he said measures, such as directed and targeted assistance for lower-income households, could be improved with increased Government revenue created by a growing economy. 14 key resolutions have also been agreed to that need to be addressed immediately. They include a call on Government to immediately prioritize the upgrading and maintenance of Fiji’s water, sewerage supply and waste management systems in urban centres throughout Fiji, with particular attention to the Suva-Nausori corridor. “Government noted the critical need for Government’s economic strategy to be focused on trusted leadership and good governance, climate change and environmental sustainability and improving the climate for investment and business to thrive; reinforcing the need for sound fiscal discipline in Government in both revenue raising and expenditure to address critical operational and investment needs, to bring Government debt down to fiscally manageable and responsible levels and to engage actively with development partners to capitalise on funding and development opportunities; and noted that good governance demanded better accountability from the legislative, executive and judicial arms of Government to build economic confidence – the legislature to use its processes to build consensus and consistency of policy on important long-term issues such as health, education and key industries,” he added. The National Economic Summit ended yesterday with 14 recommendations and 21-page resolutions.",
          "pubDate": "2023-04-21 21:13:25",
          "image_url": null,
          "source_id": "fijilive",
          "category": [
            "top"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "Biden to meet Philippine President at White House on May 1",
          "link": "https://www.fijitimes.com/biden-to-meet-philippine-president-at-white-house-on-may-1/",
          "keywords": [
            "News",
            "World",
            "Biden to meet Philippine President at White House on May 1",
            "Fiji Times World News",
            "Fiji World News",
            "Reuters World News",
            "Times World News",
            "World News",
            "World News Fiji Times"
          ],
          "creator": [
            "Reuters Reuters"
          ],
          "video_url": null,
          "description": "WASHINGTON/MANILA (Reuters) – U.S. President Joe Biden will meet his Philippine counterpart Ferdinand Marcos Jr at the White House on May 1 to discuss deepening economic cooperation and the Indo-Pacific region, Manila and Washington said on Friday. The treaty allies have enjoyed warmer ties since Marcos took office last June, reversing his predecessor’s anti-U.S. stance […]",
          "content": "U.S. President Joe Biden convenes the fourth virtual leader-level meeting of the Major Economies Forum (MEF) on Energy and Climate at the White House in Washington, U.S., April 20, 2023. REUTERS/Kevin Lamarque WASHINGTON/MANILA (Reuters) – U.S. President Joe Biden will meet his Philippine counterpart Ferdinand Marcos Jr at the White House on May 1 to discuss deepening economic cooperation and the Indo-Pacific region, Manila and Washington said on Friday. The treaty allies have enjoyed warmer ties since Marcos took office last June, reversing his predecessor’s anti-U.S. stance and overtures towards China, Washington’s rival in the region. The two leaders will also discuss further economic cooperation, White House spokesperson Karine Jean-Pierre said in a statement. “During the visit, President Biden will reaffirm the United States’ ironclad commitment to the defense of the Philippines, and the leaders will discuss efforts to strengthen the longstanding U.S.-Philippines alliance,” the statement said. In what will be his second trip to the United States in less than a year, the presidential palace said on Friday that Marcos will travel to Washington from April 30 to May 4 to meet Biden and key cabinet officials. “It will substantively progress efforts to further deepen…political ties, to bring about lasting socio-economic partnerships, as well as to enhance defence and security cooperation,” the palace said. Marcos will seek closer partnership in agriculture, energy, climate change, digital transformation, humanitarian assistance and disaster relief, supply chains, and infrastructure, it added. The Philippines earlier this month identified four additional military bases that the U.S. may access amid shared concerns about China’s growing might. China’s ambassador to Manila last week accused the Philippines of “stoking the fire” of regional tensions by offering the expanded base access to the U.S. More than 17,000 Philippine and U.S. soldiers are currently conducting their largest ever joint military drills in the Southeast Asian country, drawing criticism from China. (Reporting by Eric Beech in Washington and Costas Pitas and Dan Whitcomb in Los Angeles; Additional Reporting by Neil Jerome Morales in Manila)",
          "pubDate": "2023-04-21 21:06:46",
          "image_url": null,
          "source_id": "fijitimes",
          "category": [
            "sports"
          ],
          "country": [
            "Fiji"
          ],
          "language": "english"
        },
        {
          "title": "UK Bill torments Zimbabwe",
          "link": "https://mbaretimes.com/2023/04/zimbabwe-12/",
          "keywords": [
            "Zimbabwe News",
            "UK",
            "Zimbabwe"
          ],
          "creator": [
            "Kuda M"
          ],
          "video_url": null,
          "description": "BOLD moves by the British Parliament to enact legislation shutting African wildlife trophies out of that market have shaken Zimbabwean authorities, as fears mount that the country’s major tourism plan may flop. Authorities told Zimbabwe Independent this week that there were worried that once the Bill sails through, an ambitious tourism industry plan to grow … The post UK Bill torments Zimbabwe appeared first on Mbare Times.",
          "content": "BOLD moves by the British Parliament to enact legislation shutting African wildlife trophies out of that market have shaken Zimbabwean authorities, as fears mount that the country’s major tourism plan may flop. Authorities told Zimbabwe Independent this week that there were worried that once the Bill sails through, an ambitious tourism industry plan to grow sector revenue to US$5 billion by 2025 would be thrown into jeopardy. Revenues into the hunting sector alone are projected to hit US$9 million this year, from US$3 million in 2022, driven by increasing arrivals in the aftermath of the pandemic. But the Hunting Trophies (Import Prohibition) Bill, introduced in the UK’s House of Commons on June 15 last year, appears to be a major hurdle. It prohibits the importation of hunting trophies of certain animals listed by the Convention on International Trade in Endangered Species of Wild Fauna and Flora as vulnerable. British legislators recently voted to support the ban. The Bill, which has also sent shivers across southern Africa’s tourism reliant economies, also prevents British hunters from importing the body parts of lions, elephants and giraffes – the animals that fetch significant foreign currency revenue for Zimbabwe. In an interview with the Independent, Zimbabwe Parks and Wildlife Management Authority (ZimParks) spokesperson Tinashe Farawo said there were fears other markets may follow suit. He said authorities were concerned that the Bill disregarded Zimbabwe’s unique situation where targeted species’ populations were growing. “Zimbabwe has demonstrated that a ‘well-managed’ trophy hunting system is an effective conservation tool whose benefits also spill over to communities living with dangerous wildlife,” Farawo said.”Contrary to what some countries have been made to believe, our desire to trade in wildlife has never taken precedence over our responsibility to maintain the integrity of ecosystems.” He said the ban had also disregarded the fact that Zimbabwe had in place a successful wildlife management system. “It is important for our wildlife to have direct economic value to our local people, beyond the non-consumptive tourism value chain. If the Bill goes on to become law, it has a significant negative effect on Zimbabwe’s foreign currency inflows and will certainly leave rural communities worse off,” Farawo said. The United States has also been drafting similar legislation to ban the importation of endangered species to strengthen countries’ conservation efforts. “Other European countries will almost certainly pass similar laws hence magnifying the consequences of such a decision. This is a decision driven by a neo-colonial agenda far divorced from conservation interests,” he said. In an interview with the Independent two weeks ago, Safari Operators Association of Zimbabwe (SOAZ) president Emmanuel Fundira said curbs to international trade in trophies would hurt the hunting sector. Fundira said through the Bill, a form of “re-colonisation” was sweeping through African markets this year. He said the industry was being ‘penalised’, instead of being recognised for its conservation efforts. This year’s trade is likely to be bolstered by firming demand from Russia, where oligarchs have been forced to scout for alternative hunting markets after being slapped with sanctions in multiple destinations since Moscow’s conflict with Ukraine exploded last year. “(We are) facing the usual challenges from the West where, with regret, our successes in conservation continue to be penalised instead of being accorded appropriate reward,” the Soaz boss said. “Policy-makers in various source markets, in particular the USA and United Kingdom, continue to advocate and push for retrogressive legislation, which does not take into consideration community empowerment and protection of livelihoods through sustainable use. Simply put, (it is) a form of re-colonisation,” Fundira, chief executive officer at Astoc Leisure Group, said. Source: bulawayo24 PRESIDENT Emmerson Mnangagwa yesterday said he will proclaim election date next month, ending speculation that the polls might be postponed to allow for formation of a coalition government. Speaking at the official opening of the refurbished Mhondoro Hospital in Mubaira, Mashonaland West province, Mnangagwa said: “I am the only one who knows the date of elections, I will be announcing that date at the end of next month.” Learn more",
          "pubDate": "2023-04-21 20:30:19",
          "image_url": null,
          "source_id": "mbaretimes",
          "category": [
            "top"
          ],
          "country": [
            "Zimbabwe"
          ],
          "language": "english"
        },
        {
          "title": "Canadian consumers pull back on spending amid high prices, interest rates: Experts",
          "link": "https://www.vicnews.com/business/canadian-consumers-pull-back-on-spending-amid-high-prices-interest-rates-experts/",
          "keywords": [
            "Business",
            "Retail"
          ],
          "creator": [
            "The Canadian Press"
          ],
          "video_url": null,
          "description": "Retail sales slipped 0.2 per cent to $66.3 billion in February",
          "content": "Canadian consumers are pulling back on spending as rising prices and high interest rates appear to be taking a toll on retail sales. Retail sales slipped 0.2 per cent to $66.3 billion in February amid a drop in spending at general merchandise stores and gasoline stations and fuel vendors, Statistics Canada said Friday. The early estimate for March also points to an even steeper decline of 1.4 per cent, though the agency cautioned the figure would be revised. “We’re starting to see consumers tighten their belts,” retail analyst Bruce Winder said. “Canadian consumers are incredibly cautious right now.” Economists have warned of a lag between rising prices and high interest rates and the affect on the economy. While the Bank of Canada held its key lending rate at 4.50 per cent at its most recent rate decision, it is up from 0.25 per cent at the start of 2022. “It is clear that consumer spending behaviour has been impacted by the rapid rise in interest rates even as the economy as a whole has generally outperformed expectations,” Andrew Grantham, senior economist with CIBC Capital Markets, said in a client note. Still, the pull back in consumer spending could help ease inflation even further, he said. “This sluggishness in spending should help keep goods price inflation under control (assuming supply chain issues don’t worsen again), allowing the Bank of Canada to stay on hold for the remainder of this year before gradual cuts start early in 2024,” Grantham said. The annual rate of inflation in Canada dropped to 4.3 per cent in March, but grocery prices climbed 9.7 per cent on a year-over-year basis, Statistics Canada said Tuesday. For February, retail sales were down in four of the nine subsectors as sales at gasoline stations and fuel vendors fell 5.0 per cent for the month and general merchandise retailers lost 1.6 per cent. Meanwhile, sales at motor vehicle and parts dealers rose 0.9 per cent in February. Core retail sales — which exclude gasoline stations and fuel vendors and motor vehicle and parts dealers — increased 0.1 per cent helped by a 4.4 per cent gain in sales at clothing, clothing accessories, shoes, jewelry, luggage and leather goods retailers. “Consumers are picking are choosing where they cut spending,” Winder said. “More companies are quietly nudging workers back into the office, so that could be helping spending in some areas.” In volume terms, a measure that adjusts for the impact of inflation, overall retail sales fell 0.7 per cent in February. The Bank of Canada’s business outlook and consumer expectations surveys released earlier this month found that the economy has been relatively resilient amid high interest rates but that’s expected to change in the coming months. With a potential recession looming, the surveys showed consumers expect to pull back on spending and businesses anticipate sales will slow. The Bank of Canada found almost half of firms have adjusted their business plans to account for a recession while consumers are planning to spend less on activities such as travel and going to restaurants over the next year. —Brett Bundale, The Canadian Press READ MORE: Retail spending in Canada shows signs of slowdown amid higher inflation, interest Retail",
          "pubDate": "2023-04-21 20:30:00",
          "image_url": "https://www.vicnews.com/wp-content/uploads/2023/04/32496433_web1_20230421080452-6442878569ee68b8cda9ca0fjpeg-1024x688.jpg",
          "source_id": "vicnews",
          "category": [
            "top"
          ],
          "country": [
            "canada"
          ],
          "language": "english"
        },
        {
          "title": "National Bank CEO worried about effect of remote work on downtown Montreal",
          "link": "https://www.thestar.com/business/2023/04/21/national-bank-ceo-worried-about-effect-of-remote-work-on-downtown-montreal.html",
          "keywords": null,
          "creator": [
            "Stéphane Rolland - The Canadian Press"
          ],
          "video_url": null,
          "description": null,
          "content": "MONTREAL - The CEO of National Bank plans to maintain a flexible approach toward his employees working in the office, even though he’s worried about the impact remote work is having on the vitality of downtown Montreal. Laurent Ferreira said he’s worried about the effect the widespread adoption of telecommuting is having on small businesses in Montreal’s downtown business district. “I’m concerned for downtown Montreal and I think the business community has a very great responsibly (to ensure) the dynamism of Montreal’s ecosystem,” he said in an interview Friday, during the bank’s annual shareholders meeting. But, for now, Ferreira doesn’t want to impose anything on his teams. “We want a flexible approach. We want the teams to organize themselves and for them to decide when they need to meet, work together,” he said. It’s an approach that contrasts with that of the Royal Bank of Canada, which has asked its employees to work from the office three or four days a week, depending on the nature of their work. National Bank is suggesting workers come in 40 per cent of the time, though Ferreira said he would like a “better balance” that sees employees coming in more frequently. But he said telecommuting hasn’t had a negative affect on the productivity of the bank’s employees. Around 12,000 people work at National Bank’s downtown Montreal headquarters. The bank will begin gradually moving into a new 40-storey tower during the second half of the year. The project, announced in 2018, represents an investment of more than half a billion dollars. Ferreira told the shareholder meeting he expects the economy to slow in 2023 and 2024, but noted that the job market remains resilient. National Bank is in an enviable position to deal with an economic slowdown, Ferreira said, with higher capital reserves than its peers. “Because we’re in an advantageous position, that might allow us to gain market share,” he said. National Bank’s capital ratios were at 12.6 per cent on Jan. 31. “It’s more than the required minimum of 11 per cent and more than most peers when you take into account their acquisition plans,” said Darko Mihelic, an analyst at RBC Capital Markets. National Bank wants to grow organically, without acquisitions, in other Canadian provinces and has identified commercial banking and wealth management as its main avenues for growth. “That’s where we’re putting the emphasis, especially outside Quebec, but you understand that commercial and wealth management clients also need a bank account and a credit card, so it’s all related,” he said. Like the CEOs of other large Canadian banks, Ferreira was asked about the institution’s environmental policies during the shareholders meeting. The bank does not want to completely divest from the oil and gas sector, but want to support companies that are making efforts to decarbonize their operations. This report by The Canadian Press was first published April 21, 2023. Companies in this story: (TSX:NA) Anyone can read Conversations, but to contribute, you should be a registered Torstar account holder. If you do not yet have a Torstar account, you can create one now (it is free) Sign In Register",
          "pubDate": "2023-04-21 20:05:10",
          "image_url": null,
          "source_id": "thestar",
          "category": [
            "business"
          ],
          "country": [
            "canada"
          ],
          "language": "english"
        },
        {
          "title": "How to benefit from gold investing right now",
          "link": "https://www.cbsnews.com/news/how-to-benefit-from-gold-investing-right-now/",
          "keywords": null,
          "creator": null,
          "video_url": null,
          "description": "If you're facing uncertainty in today's market, gold could help in multiple ways. Here's how.",
          "content": "Gold can help provide stability in an uncertain economic environment. Getty Images/iStockphoto This year, many investors may be feeling plagued by ongoing inflated prices, high interest rates and a volatile stock market. While uncertainty can come and go , you can benefit from securing your investment portfolio to best weather any storms ahead. That's one reason why gold is a popular investment option . It's appealing as a portfolio diversifier as well as a hedge against inflation and counterbalance to more tumultuous markets. If you're considering adding gold as an investment, start by comparing gold options . How to benefit from gold right now Here are a couple of reasons you could benefit from investing in gold today: Diversify your portfolio Diversification is one of the best ways to protect your investments over the long term. And a great way to diversify is with asset types that tend to react differently from each other over time. Gold is commonly sought-after by uncertain investors, thanks to its often inverse performance to other types of assets. Take last year, for example. While stock prices went down on the whole — the S&P 500 index fell by about 19% over the year — gold prices remained steady over the same period. Not every year will look like 2022, and the stock market's potential highs can help boost your portfolio over the long run. But diversification helps you weather periods when traditional markets are down. \"Rising concerns around the economy is becoming an increasing risk,\" says Samuel Leach, an investing expert and founder of Samuel & Co. Trading, pointing to factors like rising interest rates and stock market turbulence. If you're worried about economic uncertainty today, then start exploring your gold investing options here . Stability amid inflation Not only are the markets volatile, but inflation has kept prices up over the past year. And though data shows consumers are feeling relief in some areas, everything from utilities to food remains high . Inflation also causes a decline in the value of the dollar, since its buying power goes down. Think, for example, about the last time you went to the grocery store and it cost more to buy a carton of eggs than the time before, or prices at the gas pump were up by more than a few cents. There's one bright spot amid ongoing price pressures for some investors, though. Gold prices tend to do well even as the value of the dollar falls during inflationary periods. In fact, gold prices today are near their all-time high. Consider the relationship between the price of the dollar and the price of gold over the past six months. Driven by bank failures earlier this year, high inflation and interest rates, the dollar's price value has fallen by around 9%, while gold has risen by about 20% in the same period. While the value of gold can drop over time too, its price stability generally makes it a good hedge against the current inflationary economic environment. The bottom line Uncertain economic times can lead many investors to consider the stability of an investment like gold . Gold could make sense for your portfolio and overall financial plan if you're looking for a way to diversify and weather ongoing inflation and volatility. There are plenty of ways to invest, too. Gold IRAs and gold ETFs are two common investment options, but you may also choose to hold physical gold bullion or gold futures . Before making any new investment, consider how it may affect your long-term goals. Learn more about investing in gold with a free information kit . MoneyWatch: Managing Your Money More Is life insurance worth it? How to use your home equity this summer How to benefit from gold investing right now Why you should get travel insurance, according to experts Following Apple's savings account news, is now the right time to open an account? More",
          "pubDate": "2023-04-21 20:01:14",
          "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/04/21/1e930f7f-1fe0-480b-b1a6-2259a1e3c2f7/thumbnail/60x60/314499a001fe0a6efe2a706720759445/gettyimages-1217504901.jpg",
          "source_id": "cbsnews",
          "category": [
            "top"
          ],
          "country": [
            "united states of america"
          ],
          "language": "english"
        }
  ],
  "technology": [
    {
      "title": "iQOO 12 में होगी दमदार बैटरी और धुंआदार चार्जर",
      "link": "https://jantaserishta.com/technology/iqoo-12-will-have-strong-battery-and-smoky-charger-2258735",
      "keywords": [
        "प्रौद्योगिकी"
      ],
      "creator": [
        "Admin4"
      ],
      "video_url": null,
      "description": null,
      "content": "iQOO ब्रांड एक नया स्मार्टफोन तैयार कर रहा है, जिसका नाम iQOO 12 होगा। यह एक फ्लैगशिप स्मार्टफोन हो सकता है। लेटेस्ट जानकारी के मुताबिक, इस फोन में 5000mAh की बैटरी और 200W का चार्जर इस्तेमाल किया जा सकता है। iQOO 12 सीरीज में दो स्मार्टफोन को पेश किया जा सकता है, जिनके नाम iQOO 12 और iQOO 12 Pro होंगे। आईकू की इस सीरीज को लेकर अब तक कई स्पेसिफिकेशन सामने आ चुके हैं। लेटेस्ट जानकारी डिजिटल चैट स्टेशन ने शेयर किए हैं और उसमें चार्जिंग की काबिलियत व बैटरी कैपिसिटी की जानकारी शेयर की है। ऐसे में इस दमदार चार्जर की बदौलत स्मार्टफोन की बैटरी तेजी से चार्ज होगी। इस हैंडसेट में क्वालकॉम का फ्लैगशिप चिपसेट का इस्तेमाल किया जा सकता है। साथ ही इसमें कई एडवांस फीचर्स भी देखने को मिलेगे। आइए जानते हैं इसके बारे में।iQOO साल 2022 के जुलाई महीने में 200W के वायर चार्जर के साथ iQOO 10 Pro को लॉन्च कर चुकी है। यह लॉन्चिंग अभी चीन में हुई है और चीन के बाहर के देशों में कब तक लॉन्च होंगे, उसके बारे में कोई जानकारी नहीं दी है। इसके अलावा iQOO 11 Pro को ऑफिशियली चीन में लॉन्च किया जा चुका है। जनवरी में टिप्स्टर डिजिटल चैट स्टेशन ने बताया था कि iQOO 12 के स्टैंडर्ड एडिशन मे फास्ट वायर चार्जर के अलावा फास्ट वायरलेस चार्जर भी मिलेगा। इसमें 50W का वायरलेस चार्जर मिलेगा। जानकारी के मुताबिक, iQOO 12 और iQOO 12 Pro में अपकमिंग Snapdragon 8 Gen 3 चिपसेट देखने को मिलेगा। इस स्मार्टफोन को इस साल के आखिर तक पेश किया जा सकता है। Redmi Note 12 Explorer स्मार्टफोन भी चीन में लॉन्च हो चुका है, जो 210W के फास्ट चार्जर के साथ आता है। कंपनी का दावा है कि इस स्मार्टफोन का चार्जर मोबाइल को सिर्फ 5 मिनट में 0-66 प्रतिशत चार्ज कर देता है। इस हैंडसेट में 200MP का कैमरा और 12GB रैम मिलती है।",
      "pubDate": "2023-04-23 14:29:31",
      "image_url": null,
      "source_id": "jantaserishta",
      "category": [
        "technology"
      ],
      "country": [
        "india"
      ],
      "language": "hindi"
    },
    {
      "title": "'People are suffering': Food stamp woes worsen Alaska hunger",
      "link": "https://www.princegeorgecitizen.com/politics/people-are-suffering-food-stamp-woes-worsen-alaska-hunger-6895749",
      "keywords": null,
      "creator": [
        "Mark Thiessen And Becky Bohrer",
        " The Associated Press"
      ],
      "video_url": null,
      "description": "EAGLE RIVER, Alaska (AP) — Thousands of Alaskans who depend on government assistance have waited months for food stamp benefits, exacerbating a long-standing hunger crisis worsened by the pandemic, inflation and the remnants of a typhoon that wiped o",
      "content": "EAGLE RIVER, Alaska (AP) — Thousands of Alaskans who depend on government assistance have waited months for food stamp benefits, exacerbating a long-standing hunger crisis worsened by the pandemic, inflation and the remnants of a typhoon that wiped out stockpiles of fish and fishing equipment. The backlog, which began last August, is especially concerning in a state where communities in far-flung areas, including Alaska Native villages, are often not connected by roads. They must have food shipped in by barge or airplane, making the cost of even basic goods exorbitant. Around 13% of the state's roughly 735,000 residents received Supplemental Nutrition Assistance Program benefits — or SNAP — in July, before the troubles began. “People are struggling and having to make choices of getting food or getting heating fuel,” said Daisy Lockwood Katcheak, city administrator in Stebbins, an Alaska Native village of 634 people, more than 400 miles (644 kilometers) northwest of Anchorage. Faced with food shortages and rampant inflation, the city recently used $38,000 in funds raised for a children's spring carnival to buy residents basic supplies. The community on Alaska's western coast is also reeling from the remnants of a typhoon that destroyed a critical stockpile of fish and fishing boats at the same time problems with the food stamp program were emerging. “My people are suffering first hand,” said Katcheak. Alaska lawmakers have responded to the state's sluggish response, as lawsuits have alleged failures in the state's administration of the food stamps and a program that provides aid to low-income Alaskans who are blind, elderly or have disabilities. Republican Gov. Mike Dunleavy authorized $1.7 million to provide relief to communities in a state that is almost 2 1/2 times the size of Texas. Lawmakers approved emergency funding to hire staff to handle the crush of cases as food banks have reported the highest level of demand they have seen. “We know a lot of people that are not eating multiple meals a day; they’ve drawn down to maybe a single meal,” said Anthony Reinert, director of programs at the Food Bank of Alaska. There has always “been a baseline of hunger in Alaska. But it’s spread and expanded pretty significantly in the last six months.” The hunger crisis in Alaska stems from a perfect storm of cascading events, compounded by staffing and technology issues within the state health department. During the pandemic, the regular renewal process for SNAP benefits — a federal program administered by states — was suspended. Problems emerged after the state ended its public health emergency last July and recertification requirements for SNAP were reinstituted, resulting in a flood of applications. A cyberattack that targeted the state health department in 2021 complicated Alaska's ability to process the applications, said Heidi Hedberg, who was appointed health commissioner late last year. Employees who were supposed to upgrade key department computer systems were pulled away to address the attack, leaving the upgrade work undone. But 100 positions that were set to be eliminated due to anticipated efficiencies with the upgrade nonetheless were still cut, Hedberg said. In January, the backlog of applicants seeking to renew food assistance benefits had reached a high of 9,104. Officials hope to clear the recertification backlog this month and turn their attention to thousands of new applications, according to the department. “This is not how SNAP systems are supposed to work, period,” said Nick Feronti, an attorney representing Alaskans who are suing over delays and other concerns with the food stamp program. Stephanie Duboc is still waiting for assistance after submitting her application in December. She volunteers at the Chugiak-Eagle River Food Pantry in suburban Anchorage, and said the food she receives from the pantry is essential. “It would be a huge impact on my family financially,” without that help, she said. Among those suing is Rose Carney, 68, who receives $172 a month in assistance. Carney said she received a letter in September saying her benefits had been renewed — but a month later, got another letter saying her application was due the next day. She filled it out but didn't start receiving benefits until last month after contacting a lawyer, she said. Meanwhile, she added water to stretch bean soup and visited a church food pantry to get by. “I was really upset because that was like income that I was depending on, even though it was just food stamps,” said Carney. Feronti, her attorney, has 10 clients seeking class-action status, but the case has been on hold as the parties work toward a possible resolution that could compel long-term changes. The National Center for Law and Economic Justice, also involved in the case, has filed a similar lawsuit in Missouri, but Alaska's situation is “in the extreme,” said Saima Akhtar, an attorney with the center. The $1.7 million allocated by Dunleavy in February was for the food banks to address urgent needs, including the bulk purchases of goods and distribution of cash cards so people in rural communities can buy groceries on their own and support local stores. Reinert, with the food bank, said about $800,000 was used to buy staples like oatmeal, pasta, beans, canned fruit and shelf-stable cheese at cheaper prices in Washington state. The goods were then shipped to Alaska for distribution. Those supplies are beginning to reach the most needy communities, where the cost of groceries in the store are astronomically high due to the logistics of getting them there. In Bethel, a hub community in southwest Alaska, the Bethel Community Services Foundation provides food to about 350 households a month — nearly six times as many as before the pandemic. Milk at the store costs about $12.50 a gallon, while a 20-pound bag of rice is $62.49 and a 40-pound bag of a discount brand of dog food is $82.49, said Carey Atchak, the foundation's food security coordinator. That's cheap compared to the Yup'ik village of Kwethluk, a 12-mile (19-kilometer) flight from Bethel, where an 18-pack of eggs can cost almost $17 and a double pack of peanut butter goes for $25.69. \"When the lower 48 experiences these problems, they have workarounds, they have neighbors, they have connections, they have the ability to grow their own food. That's not even an option up here,” Reinert said, using a term common in Alaska for the contiguous U.S. states. “And so, we’re very, very dependent and reliant on these systems working to keep the lights on and the traffic moving up here.” ___ Bohrer reported from Juneau, Alaska. Mark Thiessen And Becky Bohrer, The Associated Press",
      "pubDate": "2023-04-23 13:36:10",
      "image_url": "https://www.vmcdn.ca/f/files/shared/feeds/cp/2023/04/20230423090432-6445343e5189cd7e42bdace6jpeg.jpg;w=960",
      "source_id": "princegeorgecitizen",
      "category": [
        "top"
      ],
      "country": [
        "canada"
      ],
      "language": "english"
    },
    {
      "title": "Zim School of Mines holds fundraising golf tournament",
      "link": "https://mbaretimes.com/2023/04/zim-school-of-mines/",
      "keywords": [
        "Zimbabwe School of Mines"
      ],
      "creator": [
        "Mimmy"
      ],
      "video_url": null,
      "description": "Zimbabwe School of Mines (ZSM) hosted a fundraising golf tournament this weekend at Bulawayo golf club as part of efforts to raise proceeds to retool aging infrastructure at the institution. 100 golf player participated in the inaugural tournament. After rubbing shoulders with prominent golfers and captains of industry, participating players were happy to have a … The post Zim School of Mines holds fundraising golf tournament appeared first on Mbare Times.",
      "content": "Zimbabwe School of Mines (ZSM) hosted a fundraising golf tournament this weekend at Bulawayo golf club as part of efforts to raise proceeds to retool aging infrastructure at the institution. 100 golf player participated in the inaugural tournament. After rubbing shoulders with prominent golfers and captains of industry, participating players were happy to have a clear discussion on the direction being taken by the institution in a sporting environment. “We are happy to be playing with prominent golfers as well as captains of industry. This is a lifetime opportunity and above that, the sporting environment also enables us to understand what the institution stands for,” said Innocent Guvakuva, a golf player. Another golf player Mpumelelo Phiri noted, “We are here to support the worthy cause as the business community because we feel as corporates we ought to be at the centre if institutions are pursuing noble causes.” Zimbabwe School of Mines Principal, Edwin Gwaze showered praise on the local community and corporate world for coming on board to support the institution’s vision. “We have 100 players for this golf tournament. We had to take advantage of the presence of corporates for the ZITF. Our belief is that by staging this tournament, it allows us to spread our wings. As you know, Zimbabwe’s economy is pinned on mining. So as an institution we need to churn out quality graduates and that can happen if we have the required infrastructure. As you can see, technology is fast changing the way we do things,” said Gwaze. The role played by the Zimbabwe School of Mines in the mining sector cannot be under estimated and Guest of Honour at the tournament, ZIMPLATS Managing Director, Stanley Segula said they had to partner the institution as it provides lifeline to their operations. “ZSM is a strategic institution in the mining sector. As players in the mining sector we believe a fully functioning ZSM gives us a quality workforce hence we are here to support them since we fish from them,” he said. Proceeds from the golf tournament are earmarked to retool the institution’s laboratory for learners to be exposed to new mining technologies. Source: ZBC Hillary Makaya, a Zimbabwean model, has been making waves recently for her decision to become a preacher. According to prophet Passion Java Makaya will be preaching at the United Family International Church (UFIC) in Zimbabwe, which is one of the largest churches in the country. The news has caused quite a stir, as Makaya is known for her successful career in modeling, and many are curious to see how she will transition to becoming a preacher. Makaya has been a successful model for several years, both in Zimbabwe and internationally. She has worked with major brands, appeared in fashion shows, and graced the covers of magazines. However, despite her success, she has always felt that there was something missing in her life. Learn More",
      "pubDate": "2023-04-23 13:06:05",
      "image_url": null,
      "source_id": "mbaretimes",
      "category": [
        "top"
      ],
      "country": [
        "Zimbabwe"
      ],
      "language": "english"
    },
    {
      "title": "رئيس غوغل يدعو إلى وضع ضوابط قانونية لتكنولوجيا الذكاء الاصطناعي",
      "link": "https://www.akhbarona.com/technology/366724.html",
      "keywords": [
        "علوم وتكنولوجيا"
      ],
      "creator": null,
      "video_url": null,
      "description": "في الوقت الذي يشتد فيه السباق بين شركات التكنولوجيا للسيطرة على حلول الذكاء الاصطناعي، دعا ساندر بيشاي رئيس شركة التكنولوجيا وخدمات الإنترنت الأمريكية العملاقة غوغل،",
      "content": "في الوقت الذي يشتد فيه السباق بين شركات التكنولوجيا للسيطرة على حلول الذكاء الاصطناعي، دعا ساندر بيشاي رئيس شركة التكنولوجيا وخدمات الإنترنت الأمريكية العملاقة غوغل، إلى وضع ضوابط قانونية للتكنولوجيا الجديدة التي يتوقع لها أن تغير مسارات العمل في مختلف الصناعات خلال السنوات المقبلة. وأشار بيشاي بشكل خاص إلى إمكانية اختلاق ما تسمى \"فيديوهات متقنة التزوير\" والتي يمكن فيها استخدام وجوه أشخاص حقيقيين في فيديوهات مسيئة أو إباحية دون إذنهم ولا حتى علمهم. وقال بيشاي في مقابلة مع شبكة تلفزيون سي.بي.إس الأمريكية: \"يجب أن يكون هناك تنظيم.. ستحتاج إلى قوانين.. يجب أن تكون هناك عواقب لمن يقوم باختلاق فيديوهات متقنة التزوير والتي تستخدم للإضرار بالمجتمع\". ويحذر الخبراء منذ وقت طويل من مخاطر الخداع والتضليل باستخدام ما يسمى الذكاء الاصطناعي التوليدي والذي يمكنه إنتاج نصوص وصور وفيديوهات تماثل تلك التي ينتجها البشر. وتزايدت هذه المخاوف مؤخراً، وبخاصة عندما تم اختلاق صورة للبابا باستخدام تقنيات الذكاء الاصطناعي، وكذلك اختلاق مجموعة صور أظهرت عملية للقبض على الرئيس الأمريكي السابق دونالد ترامب. وتنتج تطبيقات الذكاء الاصطناعي المحتوى الخاص بها اعتماداً على كمية كبيرة من البيانات التي تتم معالجتها للتعرف على أدق ملامح وخصائص وأسلوب الشخص الذي يمكن إنتاج محتوى منسوب إليه مثلاً. وفي حال إنتاج نصوص، على سبيل المثال، فإن برامج الذكاء الاصطناعي شات جي.بي.تي تكتب الجملة على أساس تحليل تسلسل الكلمات المناسب. ومن مخاطر هذه التقنية أنه يمكن في بعض الأحيان إنتاج نصوص تحتوي على معلومات خطأ تماماً دون أن يدرك المستخدم ذلك. ويقول بيشاي إن أي شخص تعامل مع الذكاء الاصطناعي لفترة من الوقت يدرك تماماً أنه أمر مختلف عن كل ما سبق من تكنولوجيا، لذلك يجب وضع لوائح وقواعد مجتمعية للتفكير في كيفية استخدام هذه التكنولوجيا. وأضاف أنه لا يجب السماح بتوفير تكنولوجيا متطورة، في حين أن المجتمع غير مستعد لاستيعابها والتعامل معها. يأتي ذلك في حين تطور شركة غوغل التي يرأسها بيشاي منصة للمحادثة باستخدام الذكاء الاصطناعي لمنافسة منصة شات جي.بي.تي التي تحقق انتشاراً سريعاً منذ إطلاقها في أواخر العام الماضي. وأطلقت غوغل على المنصة الجديدة اسم أبرينتايس بارد وهي تشبه شات جي.بي.تي التي طورتها شركة أوبن إيه.آي، لكن شركة غوغل تختبر أيضاً إمكانية استخدام صيغة سؤال وجواب في محرك البحث. وقال جيف دين كبير الباحثين في غوغل للموظفين في اجتماع خلال العام الماضي، إن غوغل متحفظة للغاية في أسلوبها لتجنب \"خطر انهيار السمعة\" نتيجة قيام أدوات الذكاء الاصطناعي بتقديم إجابات سيئة. وقال ديميس هاسابيس الرئيس التنفيذي لشركة ديب مايند لتكنولوجيا الذكاء الاصطناعي التابعة لشركة غوغل إن الشركة منخرطة أيضاً في هذه المشروعات وتفكر في طرح نسخة تجريبية من منصة محادثة بالذكاء الاصطناعي باسم سبارو خلال العام الحالي.",
      "pubDate": "2023-04-23 12:37:00",
      "image_url": "https://s1.akhbarona.com/thumbs/article_large/2/1/2023423131934872LW_1682253506.jpg",
      "source_id": "akhbarona",
      "category": [
        "technology"
      ],
      "country": [
        "morocco"
      ],
      "language": "arabic"
    },
    {
      "title": "ثغرات أمنية خطيرة في إعدادات الـ\"واي فاي\" يجب على المستخدمين إصلاحها",
      "link": "https://www.akhbarona.com/technology/366723.html",
      "keywords": [
        "علوم وتكنولوجيا"
      ],
      "creator": null,
      "video_url": null,
      "description": "حذرت هيئة اختبار السلع والمنتجات الألمانية من وجود ثغرات أمنية خطيرة تتعلق بإعداد الـ\"واي فاي\" المحمي (WPS) في ثلاثة أجهزة راوتر منتشرة.وأوضحت الهيئة أن الأجهزة",
      "content": "حذرت هيئة اختبار السلع والمنتجات الألمانية من وجود ثغرات أمنية خطيرة تتعلق بإعداد الـ\"واي فاي\" المحمي (WPS) في ثلاثة أجهزة راوتر منتشرة. وأوضحت الهيئة أن الأجهزة هي: آسوس 4G-N16 (Wireless-N300 LTE Modem Router) ودي لينك DWR-933 (4G/LTE Cat 6 Wi-Fi Hotspot)، وتي بي لينك Archer MR500 (4G+ Cat6 AC1200 WLAN Dual Band Gigabit Router). وأوضح خبراء الهيئة الألمانية أن الثغرات الموجودة في الأجهزة الثلاثة تتيح للقراصنة استخدامها للوصول إلى شبكة WLAN من أجل الاطلاع على حركة مرور الشبكة أو سرقة البيانات من الأجهزة الموجودة في شبكة WLAN أو استخدام الوصول إلى الإنترنت لأغراض سيئة. وأعلنت شركة آسوس عن تحديث برنامج الجهاز (الفيرموير) بأسرع وقت ممكن كحل فوري لجعل الراوتر آمناً مرة أخرى، وذلك بإيقاف وظيفة WPS في الإعدادات. وتقدم دي لينك تحديث الفيرموير في 21 أبريل (نيسان) الجاري، لكن وحتى ذلك الحين يمكن تغيير رمز WPS-PIN لمزيد من الأمان، وذلك لأن إيقاف تشغيل WPS لا يجعل الجهاز آمناً على عكس جهاز آسوس. وأصدرت تي بي لينك بالفعل تحديثاً للفيرموير يجب تثبيته على الفور لجعل الجهاز آمناً مرة أخرى.",
      "pubDate": "2023-04-23 12:36:00",
      "image_url": "https://s1.akhbarona.com/thumbs/article_large/0/6/router_547521223.jpg",
      "source_id": "akhbarona",
      "category": [
        "technology"
      ],
      "country": [
        "morocco"
      ],
      "language": "arabic"
    },
    {
      "title": "\"شات جي بي تي\".. أوروبا وتحدي تنظيم أدوات الذكاء الاصطناعي!",
      "link": "https://www.akhbarona.com/technology/366718.html",
      "keywords": [
        "علوم وتكنولوجيا"
      ],
      "creator": null,
      "video_url": null,
      "description": "مؤخرا اتخذت الهيئة الوطنية الإيطالية لحماية البيانات الشخصية قرارا كان الأول من نوعه في دولة غربية تمثل في حظر روبوت المحادثة \"شات جي بي تي\"",
      "content": "مؤخرا اتخذت الهيئة الوطنية الإيطالية لحماية البيانات الشخصية قرارا كان الأول من نوعه في دولة غربية تمثل في حظر روبوت المحادثة \"شات جي بي تي\" إذ عزت ذلك إلى عدم احترام البرنامج التشريعات المتعلقة بالبيانات الشخصية فضلا عن غياب وجود نظام للتحقق من عمر المستخدمين القصّر. ويرى مراقبون أن السلطات الإيطالية كانت أقل اهتماما باستخدام الذكاء الاصطناعي عن اهتمامها بانتهاكات تشريعات حماية البيانات. وبعد الحظر، قامت الهيئة الإيطالية بإبلاغ شركة \"اوبن ايه آي\" التي ابتكرت \"شات جي بي تي\" بأنه سيتعين عليها أن تكون أكثر شفافية مع مستخدميها حول كيفية معالجة بياناتهم فضلا عن ضرورة الحصول على إذن من المستخدمين في حالة ما رغبت الشركة في استخدام بياناتهم لتطوير التقنية فضلا عن ضرورة وجود قواعد للتحقق من عمر المستخدمين القصّر. وشددت الهيئة على أنه في حالة استيفاء الشركة هذه الشروط بحلول الثلاثين من أبريل / نيسان الجاري، فإنه يمكن رفع الحظر عن \"شات جي بي تي\". ونقلت وكالة رويترز عن الناطق باسم شركة \"اوبن ايه آي\" قوله إنه \"سعيد\" لأن الهيئة الوطنية الإيطالية لحماية البيانات الشخصية تدرس إعادة النظر في قرارها وأنها تتطلع إلى العمل مع الشركة لإتاحة التطبيق \"لعملائنا في إيطاليا مرة أخرى قريبا\". ليس فقط مخاوف إيطالية ولم تكن إيطاليا الدولة الوحيدة داخل الاتحاد الأوروبي التي أعربت عن مخاوفها حيال \"شات جي بي تي\" إذ انضمت إليها إسبانيا وفرنسا. يشار إلى أنه حتى الوقت الراهن، لا يوجد قانون على مستوى الاتحاد الأوروبي ينظم استخدام الذكاء الاصطناعي في منتجات مثل السيارات ذاتية القيادة أو التكنولوجيا الطبية أو أنظمة المراقبة إذ ما زال البرلمان الأوروبي يناقش تشريع اقترحته المفوضية الأوروبية قبل عامين. وعندما تتم الموافقة على التشريع، ستكون الخطوة التالية موافقة أعضاء التكتل الأوروبي فيما يُرجح أن يكون ذلك مطلع عام 2025 لتمهيد الطريق أمام دخول التشريع حيز التنفيذ. وفي أمر قد يمثل خيبة أمل للأصوات الداعية إلى تنظيم أدوات الذكاء الاصطناعي في الاتحاد الأوروبي، قال السياسي الألماني والنائب في البرلمان الأوروبي أكسل فوس الذي يعد أحد المشروعين الذين قاموا بصياغة التشريع، إنه طرأ الكثير من التقدم على الذكاء الاصطناعي خلال العامين الماضيين. ومن المرجح أن تتطور تطبيقات الذكاء الاصطناعي \"بسرعة كبيرة\" خلال العامين المقبلين ما يعني أن بعض بنود التشريع لن تكون مناسبة عندما يدخل التشريع حيز التنفيذ. بيد أنه من غير الواضح ما إذا كان \"شات جي.بي.تي\" وغيره من تطبيقات روبوتات الدردشة سوف تكون ضمن لائحة الاتحاد الأوروبي التي ستصنف أدوات الذكاء الاصطناعي المختلفة وفقا لمستوى المخاطر بداية من عالية ومنخفضة المخاطر إلى غير المقبولة فيما سيكون على عاتق الحكومات والشركات التي تستخدم هذه الأدوات، التزامات مختلفة اعتمادا على مستوى المخاطر. وبموجب التشريع، فإن البرامج التي سيتم تصنيفها \"عالية المخاطر\" أو \"ذات مخاطر محدودة\" سوف تخضع لقواعد خاصة فيما يتعلق بتوثيق الخوارزميات والشفافية والكشف عن استخدام البيانات. في المقابل سيتم حظر التطبيقات التي تسجل وتقيم السلوك الاجتماعي للأشخاص للتنبؤ بإجراءات معينة. وفي سياق متصل، مازال النقاش مستمرا تحت قبة البرلمان الأوروبي حيال نطاق السماح بتطبيقات الذكاء الاصطناعي بتسجيل أو محاكاة المشاعر فضلا عن تحديد مستويات الخطر. وفي تعليقه، قال فوس \"نحتاج أن نكون أكثر تفاؤلا حيال التعامل مع الذكاء الاصطناعي بشكل أكبر نظرا لسببين الأول الحفاظ على التنافسية والثاني بسبب تأخرنا في هذا المجال، لكن ما يحدث في البرلمان الأوروبي هو أن معظم المشرعين يحاولون استبعاد كل شئ بسبب هاجس الخوف.\" وأضاف أن مفوضي حماية البيانات في الاتحاد الأوروبي يريدون مراقبة الذكاء الاصطناعي من قبل هيئة مستقلة، لذا من المنطقي تعديل تشريعات حماية البيانات الحالية. التوازن بين حماية البيانات والاعتبارات الاقتصادية وفي ضوء ذلك، تحاول المفوضية الأوروبية وكذلك البرلمان الأوروبي تحقيق التوازن بين حماية المستهلك وفرض قواعد تنظيمية من جهة وتعزيز تطوير الاقتصاد الرقمي والأبحاث من جهة أخرى. وفي هذا السياق، قال مفوض الاتحاد الأوروبي للسوق الداخلية تييري بريتون إن الذكاء الاصطناعي يوفر \"إمكانات هائلة\" لتعزيز الاقتصاد الرقمي والرقمنة. وأضاف بريتون أنه قبل عامين عندما جرى طرح تشريع الذكاء الاصطناعي داخل الاتحاد الأوروبي، شدد مسؤولو التكتل على أن الاتحاد لا يرغب في عرقلة عمل مطوري الذكاء الاصطناعي بل يسعى إلى إقناعهم بالاستقرار في أوروبا. وحذر من أنه لا ينبغي أن يعتمد الاتحاد الأوروبي على شركات أجنبية في هذا المجال إذ يتعين تخزين بيانات الذكاء الاصطناعي ومعالجتها في الاتحاد الأوروبي. وفي مقابلة مع DW، قال مارك براكيل، الخبير في معهد Future of Life غير الربحي ومقره الولايات المتحدة، إنه يجب أن تخضع الشركات للمساءلة من قبل الهيئات المنظمة، مشددا على ضرورة عدم الاقتصار على تطبيق مستويات المخاطر على تطبيقات الذكاء الاصطناعي. واقترح أن يقوم مطورو هذه البرامج بمراقبة مخاطر كل تطبيق على حدة، مؤكدا أنه في بعض الأحيان لا تستطيع الشركات التنبؤ اليوم بما يمكن أن تفعله تطبيقات الذكاء الاصطناعي غدا. وحذر فوس من أنه حالة قيام الاتحاد الأوروبي بتعقيد عمل شركات الذكاء الاصطناعي بشكل كبير، فإن \"هذه الشركات سوف تذهب إلى أماكن أخرى وتطور خوارزمياتها وأنظمتها هناك وبعد ذلك سوف تعود إلى أوروبا وسنكون دول مستهلكة\". ومن اللافت أن تطبيق \"شات جي.بي.تي\" الذي يعد محل نقاش داخل أوروبا وأثار ضجة داخل التكتل، جرى تطويره في الولايات المتحدة بهدف الاستخدام العالمي. وقد تواجه شركة \"اوبن ايه آي\" منافسة شديدة من شركات أمريكية مثل غوغل وتويتر وأيضا شركات صينية خاصة بعد أن قامت شركة بايدو الصينية للتكنولوجيا بتطوير روبوت محادثة مدعوما بالذكاء الاصطناعي يحمل اسم \" إرني بوت\". بيد أنه في المقابل، لم تقدم أي شركة أوروبية على تطوير أي روبوت محادثة تنافس به الشركات الأمريكية والصينية. ---- بيرند ريغيرت / م. ع",
      "pubDate": "2023-04-23 12:30:00",
      "image_url": "https://s1.akhbarona.com/thumbs/article_large/0/c/chatgpt_1682253089.jpg",
      "source_id": "akhbarona",
      "category": [
        "technology"
      ],
      "country": [
        "morocco"
      ],
      "language": "arabic"
    },
    {
      "title": "BCC appoints director of engineering services",
      "link": "https://www.chronicle.co.zw/bcc-appoints-director-of-engineering-services/",
      "keywords": [
        "Headlines",
        "Local News",
        "Top Stories"
      ],
      "creator": [
        "tembadube"
      ],
      "video_url": null,
      "description": "Lizzy Nekhoma nekhomalizzy@gmail.com THE Bulawayo city council has appointed Engineer Sikhumbuzo Ncube as the Director of Engineering services starting from 1 April 2023 Eng Ncube replaces the late Eng Simela Dube who was Bulawayo’s director of engineering service from 2010 to 2021 when he died from an undisclosed ailment. In a statement, Bulawayo Town Clerk Mr […]",
      "content": "The Chronicle THE Bulawayo city council has appointed Engineer Sikhumbuzo Ncube as the Director of Engineering services starting from 1 April 2023 Eng Ncube replaces the late Eng Simela Dube who was Bulawayo’s director of engineering service from 2010 to 2021 when he died from an undisclosed ailment. In a statement, Bulawayo Town Clerk Mr Christopher Dube said: ‘‘The city of Bulawayo is pleased to announce the appointment of Engineer Sikhumbuzo Mangisi Ncube to the position of Director of Engineering Services with effect from the 1 April 2023.’’ Eng Ncube attained his first degree in Civil and Water engineering from 1998 to 2003 and his second degree in an Executive Master of Business Administration from 2009 to 2011 from the National University of Science and Technology (Nust). His profile from the local authority reads: “He began his professional career as Student Engineer with Stewarts and Llyods – Bulawayo Office in 2002. He then joined the Zimbabwe National Water Authority after his graduation where he worked as a Projects and Planning Engineer, and Water Supplies Engineer (2004 – 2006). He also worked with Proplastics, a Division of Murray and Roberts as a Design and Sales Engineer and Acting Regional Sales Manager (2006 – 2007). “He thereafter joined World Vision Zimbabwe where he held several roles such as Water Sanitation and Hygiene (WASH) Engineer and Water and Sanitation Coordinator. Eng Ncube joined the City of Bulawayo as a Senior Engineer – Waste Water in 2010 and also worked as a Senior Engineer – Water Distribution before his promotion to Principal Engineer – Strategic Planning (2015 – 2018). He was further promoted to the position of Deputy Director of Engineering Services (Water and Sanitation) in February 2018 and has been Acting Director in the Engineering Services Department from January 2022 till his appointment.” Eng Ncube is a dynamic Engineer with demonstrated history and substantial experience in all aspects of civil engineering and water and sanitation project planning, implementation and management. He has worked on a number of flagship projects including the Bulawayo Water and Sewerage Services Project (BWSSIP) funded by the African Development Bank as Coordinator and Technical Specialist, Local Coordinator with the Netherlands funded WaterWorx project, Climate Change Expert, Nyamandlovu Aquifer construction, rehabilitation of earth dams and establishment of irrigation schemes and has represented the City in other national projects. He has expertise in feasibility studies and proposal writing, project planning design and stakeholder participation and involvement for sustainable WASH Solutions. He also has experience in contract management, project administration, and exposure with different funding institutions. Eng Ncube is a Corporate Member of the Zimbabwe Institute of Engineers, Professional Engineer with the Engineering Council of Zimbabwe, Committee Member of the Matabeleland Chapter (ZIE) (2017 – 2022), Committee Member of Bridge Building and Water Network Competition for National High Schools under Matabeleland ZIE (2017 – 2022), Former member of the Zimbabwe Emergency Response Team (ZERT) with World Vision (2008 – 2009) and Standards Association of Zimbabwe (SAZ) Committee Member (2018 – 2019). He is also a board member of various organisations and institutions.",
      "pubDate": "2023-04-23 12:03:30",
      "image_url": null,
      "source_id": "chronicle_zw",
      "category": [
        "top"
      ],
      "country": [
        "Zimbabwe"
      ],
      "language": "english"
    },
    {
      "title": "Precision missiles, budget bombs expected in defence review",
      "link": "https://thenewdaily.com.au/news/politics/2023/04/23/defence-review-budget-bombs/",
      "keywords": [
        "Australian Politics",
        "Politics",
        "Australian Defence Force",
        "Defence",
        "Federal budget"
      ],
      "creator": [
        "James Robertson"
      ],
      "video_url": null,
      "description": "Tens of billions worth of department of defence projects are expected to be scrapped and reprioritised after a review into Australia’s national defence strategy tipped to recommend new missile purchases … Continued The post Precision missiles, budget bombs expected in defence review appeared first on The New Daily.",
      "content": "Tens of billions worth of department of defence projects are expected to be scrapped and reprioritised after a review into Australia’s national defence strategy tipped to recommend new missile purchases and uncover budget bombs. A public version of the Defence Strategic Review will be released on Monday, months after being handed in by Sir Angus Houston and former defence minister Stephen Smith in February. The review will look at the scale and nature of Australia’s military forces and comes against the backdrop of a recent commitment to a $368 billion acquisition of nuclear-powered submarine technology and the reconfiguration of America’s military footprint in Asia. A well-placed source said the review would consider more than Australia’s strategic posture but more fundamental questions, such as the structure of the defence forces.0 Australia’s largely defensive military posture has for decades had a similar rough structure based on a dozen surface ships, half-a-dozen submarines, seven infantry battalions and three-to-four combat squadrons. With the regional environment dominated by a rising China, Defence Minister Richard Marles has said this should be reorganised so Australia is more capable of “impactful projection”. This rhetoric is coinciding with expected changes including spending more on rocket-artillery, including “ ” and land-to-sea The ABC has reported that a planned acquisition of “infantry fighting vehicles” will be slashed from 450 to 129. “It’s an incredibly important piece of work, because what it seeks to do is really restate Australia’s strategic posture for the first time more than 35 years,” Mr Marles told Sky on Sunday. “We obviously live in a very different world today, to the one that Paul Dibb was looking at when he wrote the Dibb Review back in 1985-86, which has really been the heart of our strategic posture since that time.” Another $14.9 billion will need to be returned to the spiralling cost of national defence, according to the , to cover the previous government’s underfunding of certain projects. That will include, a well-sourced US defence industry news site reports, some $8 billion in new cyber spending for the Australian Signals Directorate’s ‘Project REDSPICE’, or what it describes as Australia’s answer to the “How is it that not a single voice from the entire Defence establishment piped up and told anyone?” asked David Shoebridge, a Greens Senator, about the unbudgeted programs. “There is a dangerous culture of secrecy and disinformation within the Australian Defence Force and department that allows governments to hide these damaging truths, and that lack of honesty is clearly a threat to national security.”",
      "pubDate": "2023-04-23 12:00:28",
      "image_url": null,
      "source_id": "thenewdaily",
      "category": [
        "top"
      ],
      "country": [
        "australia"
      ],
      "language": "english"
    },
    {
      "title": "Nigerian govt to raise N180bn revenue through project concession –- ICRC",
      "link": "https://dailynigerian.com/nigerian-govt-raise-revenue/",
      "keywords": [
        "News",
        "Newsletter",
        "FEC",
        "federal government",
        "ICRC",
        "NAFDAS",
        "Niger",
        "TME"
      ],
      "creator": [
        "Ibrahim Ramalan"
      ],
      "video_url": null,
      "description": "The Infrastructure Concession Regulatory Commission, ICRC, has said that the approval of the concessioning of its two projects by the Federal Executive Council, FEC, would attract N180 billion revenue to Nigeria. A statement issued in Abuja on Sunday by Ifeanyi Nwoko, Acting Head, Media and Publicity, ICRC, said the projects included the Cassava Bio-mass and […] The post Nigerian govt to raise N180bn revenue through project concession –- ICRC appeared first on Daily Nigerian.",
      "content": "The Infrastructure Concession Regulatory Commission, ICRC, has said that the approval of the concessioning of its two projects by the Federal Executive Council, FEC, would attract N180 billion revenue to Nigeria. A statement issued in Abuja on Sunday by Ifeanyi Nwoko, Acting Head, Media and Publicity, ICRC, said the projects included the Cassava Bio-mass and Bio-ethanol Value Chain and National Fire Detection And Alarm System, NAFDAS. Mr Nwoko said the concessioning was to create wealth, reduce poverty, improve food security and nutrition, provide jobs and renewable energy, and reduce carbon footprint. “While the NAFDAS project will generate a total of N75 billion in the 15-year concession period, the cassava bio-ethanol value chain will generate a total revenue of N105 billion within the five-year concession period. “The cassava bio-ethanol value chain, which will be done on a pilot phase, aims to build a Bio-technology Industrial Park on a 20-hectare plot across 20 universities, academia and research and development institutes. “In the pilot phase, 5,000 special hybrid cassava (TME 419) stems will be planted per hectare, (totalling) 100,000 stems for the 20 hectares,” he said. In addition, he said the project would supply organic fertiliser, boosters, conditioners, pre and post-emergent herbicides, pesticides, insecticides, fungicides, and knapsack sprayers. “The project also seeks to double cassava production from the current 62 million tons to an output of no fewer than 120 million tons. “With improved tropical agro-ecology, bio-technology, intense mechanisation, and effective partnership resource mobilisation, Nigeria can double output to 120 million metric tons in five years,” he said. Mr Nwoko said the key goal of the cassava-bioethanol pilot project was to demonstrate the efficacy of a private sector-led approach in promoting investment in renewable biomass and creating wealth. “Also in providing jobs, reducing poverty, improving food security and nutrition, providing renewable energy and reducing carbon footprint,” he said. Mr Nwoko said the project was proposed to be financed with a grant from the Federal Government and Concessionaire investment totalling N11.9 billion. The ICRC spokesman said the revenue stream presented by the project includes sales of cassava stem, cassava flour, garri, starch, and Bio-ethanol. “Total revenue for the five-year concession period is N105,610,000,000,” he said. He said that the NAFDAS project would provide fire mitigation hardwares, softwares, and equipments that would be linked to a cloud network. Nwoko said the project would be supervised by the Federal Fire Service through a private entity. NAN Save my name, email, and website in this browser for the next time I comment. Δ document.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() );",
      "pubDate": "2023-04-23 11:35:19",
      "image_url": null,
      "source_id": "dailynigerian",
      "category": [
        "top"
      ],
      "country": [
        "nigeria"
      ],
      "language": "english"
    },
    {
      "title": "Disha Patani wore such an open dress, the person sitting with her kept staring – Watch",
      "link": "https://www.informalnewz.com/disha-patani-wore-such-an-open-dress-the-person-sitting-with-her-kept-staring-watch-236578/",
      "keywords": [
        "Entertainment",
        "Disha Patani",
        "Disha Patani bikini pic",
        "Disha Patani Birthday",
        "Disha Patani bod video"
      ],
      "creator": [
        "Shyamu Maurya"
      ],
      "video_url": null,
      "description": "Disha Patani continues to create a sensation on social media with her killer outfits. Once, the actress went to an award function in such a way that people were left watching. New Delhi: Bollywood actress Disha Patani keeps raising the internet temperature with her glamorous photos. Seeing more than one of her outfits, where the […] The post Disha Patani wore such an open dress, the person sitting with her kept staring – Watch first appeared on informalnewz.",
      "content": "Sunday, April 23, 2023 Facebook Instagram Twitter Youtube Education Entertainment Finance Fuel Price Gold Rate today Hindi Jobs Alert Latest Cricket News Sports Technology More Search Home Entertainment Disha Patani wore such an open dress, the person sitting with her... Entertainment Disha Patani wore such an open dress, the person sitting with her kept staring – Watch By Shyamu Maurya April 23, 2023 0 475 Share Facebook Twitter Pinterest WhatsApp Telegram Disha Patani wore such an open dress, the person sitting with her kept staring – Watch Disha Patani continues to create a sensation on social media with her killer outfits. Once, the actress went to an award function in such a way that people were left watching. New Delhi: Bollywood actress Disha Patani keeps raising the internet temperature with her glamorous photos. Seeing more than one of her outfits, where the beauties eat sour, the boys start ringing in the hearts of their love after seeing their beauty. But a person got so entangled in Disha’s dress that he could not take her eyes off. He kept staring at the actress’s body, which was clearly visible from the dress. Disha’s killer dress Tiger Shroff’s girlfriend Disha Patani is often in discussion about her bo*ldness. In the year 2017, the 62nd Jio Filmfare Awards function was held in Mumbai. When Disha reached this award function, everyone’s eyes were fixed on her. Disha Patani arrived in this event wearing a very revealing dress. Seeing such a revealing dress of the actress, a person could not control her desires. Man lost sight In this award, Disha Patani was wearing a black color dress with deep cleavage. Her dress was attracting everyone in this event. Meanwhile, such a scene was captured in the camera, after which Disha had to be very embarrassed. Actually, an unknown person was sitting next to Disha. Who was constantly staring at her. At the same time, Disha was unaware of this. When this show was telecast, then the evil eye of this person came to the fore. Disha’s movies Disha Patani remains in the headlines for her personal life as well as her professional life. She keeps on going on vacation with Tiger Shroff. Although the two never share pictures of the trip together. Talking about the workfront, Disha Patani was last seen in the film Radhe opposite Salman Khan. This film was released on the occasion of Eid. Now she will soon be seen in Ek Villain 2 with John Abraham and Aditya Roy Kapur. Mohit Suri is directing this film. Seeing the bo*ld style of Mouni Roy, people got intoxicated, sitting on the chair showed s*xy acts Tags Disha Patani Disha Patani bikini pic Disha Patani Birthday Disha Patani bod video Share Facebook Twitter Pinterest WhatsApp Telegram Previous article Nyasa Devgan crossed all limits to look beautiful wearing a bomb blouse, seeing the photos will make your head spin Next article Priyanka Chahar Chowdhary shared a bold photo in off-shoulder Thai-slit dress, Ankit Gupta made such a comment that went viral Shyamu Maurya Shyamu has done Degree in Fine Arts and has knowledge about bollywood industry. He started writing in 2018. Since then he has been associated with Informalnewz. In case of any complain or feedback, please contact me @informalnewz.com RELATED ARTICLES Entertainment Priyanka Chahar Chowdhary shared a bold photo in off-shoulder Thai-slit dress, Ankit Gupta made such a comment that went viral April 23, 2023 Entertainment Nyasa Devgan crossed all limits to look beautiful wearing a bomb blouse, seeing the photos will make your head spin April 23, 2023 Entertainment Avneet Kaur did a bold photoshoot in transparent bralette, sexy look captured on camera, see photos April 23, 2023 - Advertisment - Most Popular Priyanka Chahar Chowdhary shared a bold photo in off-shoulder Thai-slit dress, Ankit Gupta made such a comment that went viral April 23, 2023 Nyasa Devgan crossed all limits to look beautiful wearing a bomb blouse, seeing the photos will make your head spin April 23, 2023 Avneet Kaur did a bold photoshoot in transparent bralette, sexy look captured on camera, see photos April 23, 2023 Mastram fame Abha Paul crosses all limits of boldness in this web series, watch video April 23, 2023 Load more Recent Comments Gul Mohiudin on Kavita sister-in-law wore a sari without a blouse, seeing the pictures you will also be… Venkatesh on Urfi Javed crossed all limits, wore a front open hoodie top without inner, see photos and videos Gul Mohiudin on Malaika Arora came out in a backless strappy dress late at night, someone had to handle the gown and someone held her hand Gul Mohiudin on Priyanka Chopra reached award function without bra, shame had to be saved repeatedly in open jacket Venkatesh on Disha Patani shared a bo*ld picture while taking a bath, seeing Tiger Shroff’s heart beat will increase EDITOR PICKS Priyanka Chahar Chowdhary shared a bold photo in off-shoulder Thai-slit dress, Ankit Gupta made such a comment that went viral April 23, 2023 Nyasa Devgan crossed all limits to look beautiful wearing a bomb blouse, seeing the photos will make your head spin April 23, 2023 Avneet Kaur did a bold photoshoot in transparent bralette, sexy look captured on camera, see photos April 23, 2023 POPULAR POSTS Priyanka Chahar Chowdhary shared a bold photo in off-shoulder Thai-slit dress, Ankit Gupta made such a comment that went viral April 23, 2023 Nyasa Devgan crossed all limits to look beautiful wearing a bomb blouse, seeing the photos will make your head spin April 23, 2023 Avneet Kaur did a bold photoshoot in transparent bralette, sexy look captured on camera, see photos April 23, 2023 POPULAR CATEGORY Entertainment 17153 Finance 9186 News 3669 India 1231 Technology 1194 Travel 620 Jobs Alert 496 Education 428 ABOUT US INFORMALNEWZ brings the Latest News & Top Breaking headlines on Politics and Current Affairs. Up-to-date news coverage, aggregated from sources all over the world by informal Newz. Find latest news coverage of breaking news events, trending topics, and compelling articles. Contact us: informalnewz@gmail.com FOLLOW US Facebook Instagram Twitter Youtube © informalnewz.com 2022 Izon web Pvt. Ltd. All Rights Reserved. Home Privacy Policy Authors and Team About Us Contact US Cookie Policy Disclaimer DNPA Code of Ethics Onwership and Funding Terms of Service",
      "pubDate": "2023-04-23 11:32:41",
      "image_url": null,
      "source_id": "informalnewz",
      "category": [
        "top"
      ],
      "country": [
        "india"
      ],
      "language": "english"
    }
  ],
  "world": [
      {
        "title": "Healthcare delivery ‘in serious trouble’",
        "link": "https://www.fijitimes.com/healthcare-delivery-in-serious-trouble/",
        "keywords": [
          "Local News",
          "News",
          "Politics",
          "Fiji News",
          "Healthcare delivery 'in serious trouble'",
          "Retired and long-serving specialist surgeon Dr Eddie McCaig",
          "Times News"
        ],
        "creator": [
          "Shayal Devi"
        ],
        "video_url": null,
        "description": "One of Fiji’s leading orthopedic surgeons says healthcare delivery in the country is “in serious trouble”. Dr Eddie McCaig said the issues were obvious while speaking at the National Economic Summit (NES) third plenary session on Thursday which focused on universal coverage and basic health care. “It doesn’t take a specialist to tell us that, […]",
        "content": "Health officials help carry a patient from an ambulance outside the CWM Hospital in Suva. Dr Eddie McCaig says healthcare delivery in the country is \"in serious trouble\". Picture: JOVESA NAISUA/FILE One of Fiji’s leading orthopedic surgeons says healthcare delivery in the country is “in serious trouble”. Dr Eddie McCaig said the issues were obvious while speaking at the National Economic Summit (NES) third plenary session on Thursday which focused on universal coverage and basic health care. “It doesn’t take a specialist to tell us that, we see it in the papers and we see it from our relatives each day,” he said. “The way we treat patients has dramatically changed over the last few years, again because of socio-economic considerations. “We do not have the resources to provide all the care that is promoted by providers and desired and demanded by the public, who increasingly with travel, tourism and relatives abroad, have an unrealistic expectation of our system. “They all expect a Shortland Street type of hospital.” Dr McCaig said no public health system in the world today could adequately look after its citizens as the cost was too much. However, he acknowledged that the public sector had always received help from the private sector — whether it be through good Samaritans, donors or free medical services provided by overseas experts like those from Shriners Hospital and Sai Prema Foundation among others. In addition, Dr McCaig said visiting surgical teams from overseas also carried out procedures such as shoulder, hand, plastic, cardiac and knee surgeries. “With the failing infrastructure, we’ve all seen the photos of CWM, Savusavu and Levuka hospitals. “We also have to thank the public, people who got into their shorts and shirts etcetera and have cleaned up CWM and Levuka and continued to clean up Savusavu.”",
        "pubDate": "2023-04-21 23:30:59",
        "image_url": null,
        "source_id": "fijitimes",
        "category": [
          "top"
        ],
        "country": [
          "Fiji"
        ],
        "language": "english"
      },
      {
        "title": "Hunter Biden is a ‘deviant personality’",
        "link": "https://www.skynews.com.au/world-news/united-states/hunter-biden-is-a-deviant-personality/video/9858c6feed0c6f83f30bff2747553928",
        "keywords": [
          "United states",
          "World"
        ],
        "creator": [
          ""
        ],
        "video_url": null,
        "description": "Former advisor to John Howard, Peter McGauran, says that many Americans perceive a double standard in the US court system regarding the treatment of Republicans and Democrats, citing Hunter Biden as an example of a \"deviant personality.\" \"He's on Air Force One going to Ireland with the President, bold as brass,\" Mr McGauran told Sky News Australia. \"So Americans see a double standard, and that's why many of them will support Trump, at least temporarily.\"",
        "content": "Former advisor to John Howard, Peter McGauran, says that many Americans perceive a double standard in the US court system regarding the treatment of Republicans and Democrats, citing Hunter Biden as an example of a “deviant personality.” “He’s on Air Force One going to Ireland with the President, bold as brass,” Mr McGauran told Sky News Australia. “So Americans see a double standard, and that’s why many of them will support Trump, at least temporarily.”",
        "pubDate": "2023-04-21 23:17:22",
        "image_url": null,
        "source_id": "skynewsau",
        "category": [
          "world"
        ],
        "country": [
          "australia"
        ],
        "language": "english"
      },
      {
        "title": "Activists mark Earth Day as scientists warn of more extreme weather",
        "link": "https://www.fijitimes.com/activists-mark-earth-day-as-scientists-warn-of-more-extreme-weather/",
        "keywords": [
          "News",
          "World",
          "Activists mark Earth Day as scientists warn of more extreme weather",
          "Fiji Times World News",
          "Fiji World News",
          "Reuters World News",
          "Times World News",
          "World News",
          "World News Fiji Times"
        ],
        "creator": [
          "Reuters Reuters"
        ],
        "video_url": null,
        "description": "By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, […]",
        "content": "FILE PHOTO: A general view shows almost dried up Lake Zicksee near Sankt Andrae, as another heatwave is predicted for parts of the country, in Austria, August 12, 2022. REUTERS/Leonhard Foeger/ By David Stanway SINGAPORE (Reuters) – Volunteers in dozens of countries were set to plant trees, clean up trash and urge governments to do more to combat climate change to mark Earth Day, as scientists warn of more extreme weather and record temperatures this year. The run-up to the 54th annual celebration of the environment, officially marked on Saturday, has included a week of conservation and clean-up activities around the world, and festivals were due to begin in Rome and Boston on Friday. Thousands were expected to gather in London on Friday to begin four days of events known as the “Big One”, organised by the Extinction Rebellion activist group. A rally was to be staged in Washington urging President Joe Biden to commit to ending fossil fuel use. On Saturday, volunteers will also begin major clean-up campaigns at Lake Dal in India’s Srinigar and Florida’s hurricane-hit Cape Coral. On Thursday, Biden pledged to increase U.S. funding to help developing countries fight climate change and curb deforestation in Brazil’s Amazon rainforest during a meeting with leaders from the world’s largest economies. U.N. Secretary General Antonio Guterres told countries attending Biden’s Major Economies Forum that “a quantum leap in climate action” was required to limit temperature rises to 1.5 degrees Celsius. He warned in a recorded Earth Day message that “we seem hellbent on destruction”. Earth Day this year follows weeks of extreme weather with temperatures hitting a record 45.4 degrees Celsius (113.7 Fahrenheit) in Thailand and another punishing heatwave in India, where at least 13 people died of heatstroke at a ceremony last weekend. Scientists warned this week that killer heatwaves were putting “unprecedented burdens” on India’s agriculture, economy and public health, and undermining the country’s long-term efforts to reduce poverty, inequality and illness. Average global temperatures could hit record highs this year or in 2024, driven by climate change and the anticipated return of the “El Nino” weather phenomenon, climate scientists said on Thursday. (Reporting by David Stanway; Editing by William Mallard)",
        "pubDate": "2023-04-21 23:03:28",
        "image_url": null,
        "source_id": "fijitimes",
        "category": [
          "top"
        ],
        "country": [
          "Fiji"
        ],
        "language": "english"
      },
      {
        "title": "White House race intensifies as Biden prepares to announce re-election bid",
        "link": "https://www.skynews.com.au/world-news/united-states/white-house-race-intensifies-as-biden-prepares-to-announce-reelection-bid/video/352f69d5ba17e17303b964991262d104",
        "keywords": [
          "United states",
          "World",
          "fb",
          "msn",
          "usa",
          "world",
          "yt"
        ],
        "creator": [
          ""
        ],
        "video_url": null,
        "description": "The race for the White House is about to heat up, as US President Joe Biden is expected to announce his re-election bid next week. The Republicans watch with keen interest as they determine who will run on their party's behalf.",
        "content": "The race for the White House is about to heat up, as US President Joe Biden is expected to announce his re-election bid next week. The Republicans watch with keen interest as they determine who will run on their party’s behalf.",
        "pubDate": "2023-04-21 23:01:59",
        "image_url": null,
        "source_id": "skynewsau",
        "category": [
          "world"
        ],
        "country": [
          "australia"
        ],
        "language": "english"
      },
      {
        "title": "5 of the best budget-friendly tropical holiday destinations",
        "link": "https://www.yorkpress.co.uk/news/national/uk-today/23463172.5-best-budget-friendly-tropical-holiday-destinations/?ref=rss",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Want to take a break without breaking the bank account? Discover the best tropical destinations that are budget-friendly.",
        "content": "Taking a holiday in the sunshine, surrounded by miles of golden sand and blue seas’ sounds like a dream to many of us. But tropical breaks aren’t always cheap with many dream destinations coming with a price tag upwards of £10,000. However, away from the Maldives and Bora Bora, there are plenty more affordable options that offer you everything and more. So, you don’t have to hunt them down and look for the best deals, we’ve rounded up the five best affordable tropical destinations. The 5 best budget-friendly tropical holiday destinations Gili Islands Just a short boat ride away from Bali, Gili Islands offers a wealth of tropical living for just a quarter of the price. Set across three small islands with white sandy beaches, palm trees and impressive views of the Mt Rinjani volcano. Resorts in the area typically cost £40 per night and with food at just around £8 for two people the holiday could cost you less than £1,000. Cayo Largo del Sur Noted as having some of the best beaches in the world, Cayo Largo del Sur in Cuba has white beaches and has been described as very similar to the Maldives. Flights to Cuba typically cost around £400 but resort stays and food costs are cheap, making the trip average below £1,500. Mauritius Popular among many tropical holiday fans, Mauritius is a small island in the Indian Ocean that offers breathtaking scenery. On average, resorts cost around £140 a night with meals costing around £27 for two and flights take just over 16 hours. Koh Lipe This Thailand destination is the southernmost island in Thailand and has endless white sandy beaches and vibrantly blue water. Thailand has plenty of great deals with resorts costing less than £100 a night and food is a great price across the region too. Curacao Known as one of the Caribbean’s best-kept secrets, Curacao is filled with gorgeous beaches along its Western coast and has endless spots to watch magnificent sunsets. Resort stays cost around £100 a night with a beer at £1.50, but travel to the island can take longer than most with an average time of around 1 day. Use discount code ‘NQ15’ to get 15%ǂ off travel insurance ǂ Discount applies to base premium only. Terms & conditions apply.",
        "pubDate": "2023-04-21 23:01:00",
        "image_url": "https://www.yorkpress.co.uk/resources/images/16681492/?type=app&htype=0",
        "source_id": "yorkpress",
        "category": [
          "top"
        ],
        "country": [
          "united kingdom"
        ],
        "language": "english"
      },
      {
        "title": "‘Serious player’: Donald Trump returns to Instagram",
        "link": "https://www.skynews.com.au/world-news/united-states/serious-player-donald-trump-returns-to-instagram/video/787acea3c6e449f5fdfaf5d695cd0a4f",
        "keywords": [
          "United states",
          "World"
        ],
        "creator": [
          ""
        ],
        "video_url": null,
        "description": "Former US President Donald Trump's recent return to Instagram has made him a \"serious player\" in the United States again, according to Peter McGauran, a former advisor to John Howard. McGauran's comments come amid a surge of support for Trump from Americans following his recent appearance in court. “Because of the treatment of the courts about him,” Mr McGauran told Sky News Australia. “There’s always an enquiry, there’s always a prosecution against Trump – and nothing against any of the Democrat figures.”",
        "content": "Former US President Donald Trump’s recent return to Instagram has made him a “serious player” in the United States again, according to Peter McGauran, a former advisor to John Howard. McGauran’s comments come amid a surge of support for Trump from Americans following his recent appearance in court. “Because of the treatment of the courts about him,” Mr McGauran told Sky News Australia. “There’s always an enquiry, there’s always a prosecution against Trump – and nothing against any of the Democrat figures.”",
        "pubDate": "2023-04-21 22:59:05",
        "image_url": null,
        "source_id": "skynewsau",
        "category": [
          "world"
        ],
        "country": [
          "australia"
        ],
        "language": "english"
      },
      {
        "title": "Russia accidentally bombs its own city",
        "link": "https://www.skynews.com.au/world-news/global-affairs/russia-accidentally-bombs-its-own-city/video/e8f3f5077c4235ce01ada51bede85a90",
        "keywords": [
          "Global Affairs",
          "World"
        ],
        "creator": [
          ""
        ],
        "video_url": null,
        "description": "Moscow has admitted responsibility for the accidental bombing by the Russian air force of a residential area on the outskirts of its own city, which borders Ukraine. The incident comes as Ukraine prepares for a major counteroffensive against Russian forces.",
        "content": "Moscow has admitted responsibility for the accidental bombing by the Russian air force of a residential area on the outskirts of its own city, which borders Ukraine. The incident comes as Ukraine prepares for a major counteroffensive against Russian forces.",
        "pubDate": "2023-04-21 22:57:01",
        "image_url": null,
        "source_id": "skynewsau",
        "category": [
          "world"
        ],
        "country": [
          "australia"
        ],
        "language": "english"
      },
      {
        "title": "Caitlyn Jenner mourns death of mum Esther Jenner",
        "link": "https://7news.com.au/entertainment/celebrity/caitlyn-jenner-mourns-death-of-mum-esther-jenner-c-10421731",
        "keywords": null,
        "creator": [
          "Gabrielle Chung"
        ],
        "video_url": null,
        "description": "‘She is the only person that loved me my entire life.’",
        "content": "Caitlyn Jenner’s family has lost their beloved matriarch The Olympian’s mum, Esther Jenner, died on April 20 at the age of 96. “I am heartbroken to announce my mom passed away yesterday morning, peacefully,” Caitlyn wrote on Instagram. “Losing a mother is unique in the sense that she is the only person that loved me my entire life.” Stream the world's best reality, entertainment and true crime shows for free on 7Bravo on Esther’s death came “a few weeks shy” of her 97th birthday, Caitlyn shared. “I will miss her tremendously,” the 73-year-old added in her tribute. “Love you mom.” Fans were first introduced to Esther when Caitlyn appeared alongside ex Kris Jenner and their kids on Keeping Up With the Kardashians, appearing at various family functions. She went on to become a notable fixture on I Am Cait, the E! docu-series centred around Caitlyn’s journey as a transgender woman. “It seems as though when people start to have more understanding, the stigma of being different goes away,” Esther said on one episode of the show. “To me, that’s the beauty of [Caitlyn] giving herself permission to do this because—like for any of us—once you’ve seen something over and over again, you get more used to it, right?” Esther also joined Caitlyn as her special plus-one at the 2015 ESPYs, where the gold medal-winning decathlete was honoured with the Arthur Ashe Courage Award. During her acceptance speech, Caitlyn credited her mother for being her source of strength. “I always thought that I got my courage and my determination from my dad who landed on Omaha beach and fought all the way through World War II,” Caitlyn said at the time. “I’m realising now, mom: I think I got all of those qualities from you.” Esther is survived by friends and family, including granddaughters Kendall Jenner and Kylie Jenner.",
        "pubDate": "2023-04-21 22:54:12",
        "image_url": "https://images.7news.com.au/publication/C-10421731/7f878bfb0746fa5694765827413e8dbcb0fc307c-16x9-x0y0w2000h1125.png",
        "source_id": "7news",
        "category": [
          "entertainment"
        ],
        "country": [
          "australia"
        ],
        "language": "english"
      },
      {
        "title": "TEN FAMILY MEMBERS GUNNED DOWN IN SA",
        "link": "http://www.newsdzezimbabwe.co.uk/2023/04/ten-family-members-gunned-down-in-sa.html",
        "keywords": [
          "NEWS"
        ],
        "creator": null,
        "video_url": null,
        "description": null,
        "content": "Seven females and three males were killed when their home near the city of Pietermaritzburg was ambushed early on Friday morning. Police Minister Bheki Cele said two suspects had been arrested, one was shot dead and another is still at large. The motive is unclear. South Africa has one of the world's highest murder rates. Police were first alerted to the shooting after neighbours heard gunshots. Mr Cele said one of the victims was as young as 13, adding: \"It's a crime scene, terrible. Too many people were lost here.\" \"They have arrested two people, one was injured, one is dead, one ran away and three firearms were recovered,\" he told reporters at the scene of the shooting in the township of Imbali in eastern KwaZulu-Natal province. One child has reportedly been taken to hospital. According to local media, the gunmen managed to gain entry to the property after posing as police officers. Mr Cele confirmed they had located the suspects at the house of a witch doctor - a traditional healer - where they had sought refuge. Police said one of the suspects - the man who was shot dead - had been on their wanted list for a long time. This part of South Africa is known for featuring regularly in national crime stats for murder rates - a problem that has plagued it for a long time. It's the second mass shooting in KwaZulu-Natal province this week after four people were shot and killed on Thursday at another home north of the port city of Durban. In January, eight people were shot dead at a birthday party in Gqeberha city in Eastern Cape Province. It followed a string of gun attacks in bars last year, with at least 15 killed in one shooting alone. BBC",
        "pubDate": "2023-04-21 22:42:00",
        "image_url": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjtG2YaMQcuNConuZlhapRzMy-3H9uhM9NM30l7ZD2VJ8zyugrsMNcXnsvJ5iE5mnqIjOq5FyNQRIe0TjLet8Zqy94DvquqP3vkKYu5lx7iaOw_x9DIDRrovKCLEextz7680UVCjzsXrrUtztoSoOu_YDMoRh8xauE6GoP_kDmjqIYz9EA1UH1z7Q/s72-w400-h225-c/TEN.webp",
        "source_id": "newsdzezimbabwe",
        "category": [
          "top"
        ],
        "country": [
          "Zimbabwe"
        ],
        "language": "english"
      },
      {
        "title": "Nedbank give netball double boost",
        "link": "https://www.herald.co.zw/nedbank-give-netball-double-boost/",
        "keywords": [
          "Sport"
        ],
        "creator": [
          "aurora"
        ],
        "video_url": null,
        "description": "Ellina Mhlanga-Senior Sports Reporter THE Zimbabwe senior netball team received a boost for their Netball World Cup preparations after Nedbank Zimbabwe unveiled a US$50 000 sponsorship. The signing ceremony for the partnership between the Zimbabwe Netball Association and Nedbank was held yesterday at Stodart Netball Complex. The financial services company are the main sponsor for […]",
        "content": "Ellina Mhlanga–Senior Sports Reporter HEAD coach for junior and youth teams Briad Nhubu says they are hoping to make the best of their week-long camp to ensure athletes are ready for the African Under-18 and Under-20 combined championships. The continental meet is set for Ndola, Zambia from April 29 to May 3. Zimbabwe are fielding […] Eddie Chikamhi-Senior Sports Reporter ZIMBABWE Rugby Union president Aaron Jani says the late national team captain Iain Forsyth Buchanan left an enduring legacy for domestic rugby with a career spanning over 100 games and captaining the Sables a record 53 times. The former Sables scrumhalf died this week at the age of 74 years. A […] Tadious Manyepo-Sports Reporter CHARLES Chiutsa is flying high. Reaching for the stars. He is certainly the most notable name in this Monomotapa team who are in their second year in the Premiership in 2006. The year earlier, Chiutsa made his debut in the top-flight. And he stood toe to toe with established players like the […]",
        "pubDate": "2023-04-21 22:02:07",
        "image_url": null,
        "source_id": "herald_zw",
        "category": [
          "sports"
        ],
        "country": [
          "Zimbabwe"
        ],
        "language": "english"
      }
    ]
}